Repository: 43FUN/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/contrib/formtools/form-preview.po
Languages: ru

source: Form preview
ru: Предварительный просмотр форм

source: Django comes with an optional "form preview" application that helps automate the following workflow:
ru: Django поставляется с приложением «предварительный просмотр форм», которое может помочь автоматизировать следующую последовательность действий:

source: "Display an HTML form, force a preview, then do something with the submission."
ru: «Отобразить форму, обеспечить предварительный просмотр формы, затем что-нибудьсделать при отправке данных.»

source: To force a preview of a form submission, all you have to do is write a short Python class.
ru: Для того, чтобы обеспечить предварительный показ формы, вам понадобится написать короткий класс.

source: Overview
ru: Введение

source: Given a :class:`django.forms.Form` subclass that you define, this application takes care of the following workflow:
ru: Используя вашу реализацию класса :class:`django.forms.Form`, это приложение обеспечит следующее:

source: Displays the form as HTML on a Web page.
ru: Отображение формы на странице.

source: Validates the form data when it's submitted via POST. a. If it's valid, displays a preview page. b. If it's not valid, redisplays the form with error messages.
ru: Проверяет данные формы, при её отправке через POST. а) Если данные прошли проверку, отображает страницы для предварительного просмотра. б) Если данные не прошли проверку, заново отображает форму, показав сообщения об ошибках.

source: When the "confirmation" form is submitted from the preview page, calls a hook that you define -- a ``done()`` method that gets passed the valid data.
ru: При подтверждении отправки данных на странице предварительного просмотра, вызывает ваш обработчик (метод :meth:`~django.contrib.formtools.preview.FormPreview.done()`), который получает правильные данные.

source: The framework enforces the required preview by passing a shared-secret hash to the preview page via hidden form fields. If somebody tweaks the form parameters on the preview page, the form submission will fail the hash-comparison test.
ru: Django обеспечивает работу предварительного просмотра с помощью добавления секретного хэша в скрытые поля формы. Если кто-нибудь поменяет параметры формы на странице предварительного просмотра, то проверка секретного хэша выявит это.

source: How to use ``FormPreview``
ru: Как использовать ``FormPreview``

source: Point Django at the default FormPreview templates. There are two ways to do this:
ru: Укажите Django стандартные шаблоны для предварительного просмотра. Есть два способа сделать это:

source: Add ``'django.contrib.formtools'`` to your :setting:`INSTALLED_APPS` setting. This will work if your :setting:`TEMPLATE_LOADERS` setting includes the ``app_directories`` template loader (which is the case by default). See the :ref:`template loader docs <template-loaders>` for more.
ru: Добавьте ``'django.contrib.formtools'`` в параметр конфигурации :setting:`INSTALLED_APPS` . Этот способ будет работать, если параметр конфигурации :setting:`TEMPLATE_LOADERS` содержит загрузчик шаблонов из каталогов ``app_directories`` (по умолчанию, загрузчик там прописан). Обратитесь к :ref:`документации на загрузчик шаблонов <template-loaders>` для подробностей.

source: Otherwise, determine the full filesystem path to the :file:`django/contrib/formtools/templates` directory, and add that directory to your :setting:`TEMPLATE_DIRS` setting.
ru: В другом случае, определите путь на файловой системе до каталога :file:`django/contrib/formtools/templates` и пропишите его в параметр конфигурации :setting:`TEMPLATE_DIRS`.

source: Create a :class:`~django.contrib.formtools.preview.FormPreview` subclass that overrides the ``done()`` method::
ru: Унаследуйте класс :class:`~django.contrib.formtools.preview.FormPreview` и переопределите метод :meth:`~django.contrib.formtools.preview.FormPreview.done()`::

source: This method takes an :class:`~django.http.HttpRequest` object and a dictionary of the form data after it has been validated and cleaned. It should return an :class:`~django.http.HttpResponseRedirect` that is the end result of the form being submitted.
ru: Этот метод принимает объект :class:`~django.http.HttpRequest` и словарь с данными формы, после их проверки и нормализации. Метод должен возвращать экземпляр :class:`~django.http.HttpResponseRedirect`, который является результатом отправки формы.

source: Change your URLconf to point to an instance of your :class:`~django.contrib.formtools.preview.FormPreview` subclass::
ru: Измените настройку URL так, чтобы она указывала на созданный вами экземпляр потомка класса :class:`~django.contrib.formtools.preview.FormPreview`::

source: ...and add the following line to the appropriate model in your URLconf::
ru: ... и добавьте следующую строку в соответствующее место списка URL::

source: where ``SomeModelForm`` is a Form or ModelForm class for the model.
ru: где ``SomeModelForm`` является классом ``Form`` или ``ModelForm`` для модели.

source: Run the Django server and visit :file:`/post/` in your browser.
ru: Запустите сервер Django, откройте браузер и посетите страницу :file:`/post/`.

source: ``FormPreview`` classes
ru: Классы ``FormPreview``

source: A :class:`~django.contrib.formtools.preview.FormPreview` class is a simple Python class that represents the preview workflow. :class:`~django.contrib.formtools.preview.FormPreview` classes must subclass ``django.contrib.formtools.preview.FormPreview`` and override the ``done()`` method. They can live anywhere in your codebase.
ru: Класс :class:`~django.contrib.formtools.preview.FormPreview` — это обычный класс языка Python, который реализует функционал предварительного просмотра. Для использования данного функционала следует уналедовать этот класс и переопределить метод :meth:`~django.contrib.formtools.preview.FormPreview.done()`. Наследники этого класса могут располагаться в любом месте вашего кода.

source: ``FormPreview`` templates
ru: Шаблоны ``FormPreview``

source: By default, the form is rendered via the template :file:`formtools/form.html`, and the preview page is rendered via the template :file:`formtools/preview.html`. These values can be overridden for a particular form preview by setting :attr:`~django.contrib.formtools.preview.FormPreview.preview_template` and :attr:`~django.contrib.formtools.preview.FormPreview.form_template` attributes on the FormPreview subclass. See :file:`django/contrib/formtools/templates` for the default templates.
ru: По умолчанию форма отображается через шаблон :file:`formtools/form.html`, а страница предварительного просмотра отображается через :file:`formtools/preview.html`. Это поведение можно изменить для определённой формы с помощью атрибутов :attr:`~django.contrib.formtools.preview.FormPreview.preview_template` и :attr:`~django.contrib.formtools.preview.FormPreview.form_template` класса ``FormPreview``. Загляните в каталог :file:`django/contrib/formtools/templates`.

source: Advanced ``FormPreview`` methods
ru: Дополнительные методы ``FormPreview``

source: Given a validated form, performs any extra processing before displaying the preview page, and saves any extra data in context.
ru: Получив проверенную форму, выполняет дополнительную обработку перед отображением страницы предварительного просмотра, сохраняя все новые данные в контексте.

source: By default, this method is empty. It is called after the form is validated, but before the context is modified with hash information and rendered.
ru: Про умолчанию этот метод пуст. Он вызывается после проверки формы, но перед тем как в контекст будет добавлен хэш и страница будет сгенерирована.
