Repository: 43FUN/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/contrib/formtools/form-wizard.po
Languages: ru

source: This method fetches the data from the ``form`` Form instance and returns the dictionary. You can use this method to manipulate the values before the data gets stored in the storage backend.
ru: Этот метод получает данные из экземпляра формы ``form`` и возвращает словарь. Вы можете использовать этот метод для управления значениями перед сохранением данных в хранилище.

source: This method returns the form files. You can use this method to manipulate the files before the data gets stored in the storage backend.
ru: Этот метод возвращает файлы формы. Вы можете использовать этот метод для управления файлами перед их размещением в хранилище.

source: This method gets called after the GET or POST request has been handled. You can hook in this method to, e.g. change the type of HTTP response.
ru: Этот метод вызывается после обработки POST или GET запроса. Вы можете внедриться в этот метод, например, для изменения типа HTTP запроса.

source: This method returns the cleaned data for a given ``step``. Before returning the cleaned data, the stored values are revalidated through the form. If the data doesn't validate, ``None`` will be returned.
ru: Этот метод возвращает проверенные данный для указанного шага. Перед возвращением проверенных данных, сохранённые данные проверяются с помощью формы. Если данные не проходят проверку, то возвращается ``None``.

source: This method returns a merged dictionary of all form steps' ``cleaned_data`` dictionaries. If a step contains a ``FormSet``, the key will be prefixed with ``formset-`` and contain a list of the formset's ``cleaned_data`` dictionaries. Note that if two or more steps have a field with the same name, the value for that field from the latest step will overwrite the value from any earlier steps.
ru: Этот метод возвращает объединённый словарь с проверенными данными всех шагов. Если шаг содержит набор форм, то его ключ будет иметь префикс ``formset-`` и содержать список словарей с проверенными данными. Следует отметить, что если два или более шагов будут иметь поле с одинаковым именем, значение этого поля из более позднего шага перезапишет значение более раннего шага.

source: Providing initial data for the forms
ru: Назначение начальных данных для форм

source: Initial data for a wizard's :class:`~django.forms.Form` objects can be provided using the optional :attr:`~WizardView.initial_dict` keyword argument. This argument should be a dictionary mapping the steps to dictionaries containing the initial data for each step. The dictionary of initial data will be passed along to the constructor of the step's :class:`~django.forms.Form`::
ru: Начальные данные для экземпляров форм :class:`~django.forms.Form` мастера могут быть предоставлены с помощью необязательного именованного аргумента :attr:`~Wizard.initial_dict`. Аргумент должен представлять собой словарь, который связывает шаги со словарями начальных данных. Словарь начальных данных будет передан конструктору формы :class:`~django.forms.Form` соответствующего шага::

source: The ``initial_dict`` can also take a list of dictionaries for a specific step if the step is a ``FormSet``.
ru: Аргумент ``initial_dict`` также может принимать список словарей для определённого шага, если на этом шаге используется набор форм.

source: The ``initial_dict`` can also be added as a class attribute named ``initial_dict`` to avoid having the initial data in the ``urls.py``.
ru: Словарь ``initial_dict`` также может быть добавлен в класс в виде атрибута ``initial_dict``, чтобы не определять начальные данные в ``urls.py``.

source: Handling files
ru: Обработка файлов

source: To handle :class:`~django.forms.FileField` within any step form of the wizard, you have to add a ``file_storage`` to your :class:`WizardView` subclass.
ru: Для того, чтобы обработать поле :class:`~django.forms.FileField` на любой форме мастера, вам потребуется добавить атрибут :attr:`file_storage` в вашу реализацию класса :class:`WizardView`.

source: This storage will temporarily store the uploaded files for the wizard. The ``file_storage`` attribute should be a :class:`~django.core.files.storage.Storage` subclass.
ru: Это хранилище будет временно хранить загруженные файлы мастера. Атрибут ``file_storage`` должен быть потомком класса :class:`~django.core.files.storage.Storage`.

source: Django provides a built-in storage class (see :ref:`the built-in filesystem storage class <builtin-fs-storage>`)::
ru: Django предоставляет встроенный класс хранилища (см. :ref:`классы встроенных хранилищ <builtin-fs-storage>`)::

source: Conditionally view/skip specific steps
ru: Условная логика

source: The :meth:`~WizardView.as_view` method accepts a ``condition_dict`` argument. You can pass a dictionary of boolean values or callables. The key should match the steps names (e.g. '0', '1').
ru: Метод :meth:`~WizardView.as_view` принимает аргумент ``condition_dict``. Вы можете передать словарь булевых значений или вызываемых методов. Ключ должен соответствовать имени шага (т.е. '0', '1').

source: If the value of a specific step is callable it will be called with the :class:`WizardView` instance as the only argument. If the return value is true, the step's form will be used.
ru: Если значение определенного шага является функцией, она будет вызвана с экземпляром :class:`WizardView` в качестве аргумента.Если эта функция вернёт ``true``, то будет использована форма шага.

source: This example provides a contact form including a condition. The condition is used to show a message form only if a checkbox in the first step was checked.
ru: Этот пример показывает контактную форму со встроенным условием. Условие используется для отображения на форме сообщения в случае, если чекбокс на форме первого шага отмечен.

source: The steps are defined in a ``forms.py`` file::
ru: Шаги определяются в файле ``forms.py``::

source: We define our wizard in a ``views.py``::
ru: Мы определяем наш мастер в файле ``views.py``::

source: We need to add the ``ContactWizard`` to our ``urls.py`` file::
ru: Теперь надо добавить ``ContactWizard`` в файл ``urls.py``::

source: As you can see, we defined a ``show_message_form_condition`` next to our :class:`WizardView` subclass and added a ``condition_dict`` argument to the :meth:`~WizardView.as_view` method. The key refers to the second wizard step (because of the zero based step index).
ru: Как вы можете видеть, мы определили ``show_message_form_condition`` сразу за нашей реализацией класса :class:`WizardView` и добавили аргумент ``condition_dict`` в метод :meth:`~WizardView.as_view`. Ключ ссылается на второй шаг мастера, т.к индекс шагов начинается с нуля.

source: How to work with ModelForm and ModelFormSet
ru: Как работать с ``ModelForm`` и ``ModelFormSet``

source: WizardView supports :doc:`ModelForms </topics/forms/modelforms>` and :ref:`ModelFormSets <model-formsets>`. Additionally to :attr:`~WizardView.initial_dict`, the :meth:`~WizardView.as_view` method takes an ``instance_dict`` argument that should contain model instances for steps based on ``ModelForm`` and querysets for steps based on ``ModelFormSet``.
ru: Мастер может использовать :doc:`ModelForms </topics/forms/modelforms>` и :ref:`ModelFormSets <model-formsets>`. В дополнение к атрибуту :attr:`~WizardView.initial_dict`, метод :meth:`~WizardView.as_view` принимает аргумент ``instance_dict``, который должен содержать экземпляры ``ModelForm`` и ``ModelFormSet``. Аналогично атрибуту :attr:`~WizardView.initial_dict`, ключи этих словарей должны соответствовать номеру шага в списке форм.

source: Usage of ``NamedUrlWizardView``
ru: Использование ``NamedUrlWizardView``

source: Advanced ``NamedUrlWizardView`` methods
ru: Дополнительные методы ``NamedUrlWizardView``

source: This method returns the URL for a specific step.
ru: Этот метод возвращает URL для указанного шага.
