Repository: 43FUN/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/contrib/formtools/form-wizard.po
Languages: ru

source: Form wizard
ru: Мастер форм

source: Django comes with an optional "form wizard" application that splits :doc:`forms </topics/forms/index>` across multiple Web pages. It maintains state in one of the backends so that the full server-side processing can be delayed until the submission of the final form.
ru: Django поставляется с приложением «мастер форм», которое распределяет :doc:`формы </topics/forms/index>` по нескольким страницам сайта. Приложение хранит своё состояние в одном из бэкэндов, таким образом обработка введённой информации может быть отложена до заполнения последней формы.

source: You might want to use this if you have a lengthy form that would be too unwieldy for display on a single page. The first page might ask the user for core information, the second page might ask for less important information, etc.
ru: Вам может потребоваться это приложение для отображения длинной формы, которая является слишком громоздкой для отображения на одной странице. Первая страница может запрашивать основную информацию, а вторая страница может спрашивать дополнительную информацию и так далее.

source: The term "wizard", in this context, is `explained on Wikipedia`_.
ru: Термин «мастер» в этом контексте `описан на Википедии <explained on Wikipedia>`_.

source: How it works
ru: Как это работает

source: Here's the basic workflow for how a user would use a wizard:
ru: Рассмотрим основные шаги использования мастера пользователем:

source: The user visits the first page of the wizard, fills in the form and submits it.
ru: Пользователь открывает первую страницу мастера, заполняет форму и отправляет её.

source: The server validates the data. If it's invalid, the form is displayed again, with error messages. If it's valid, the server saves the current state of the wizard in the backend and redirects to the next step.
ru: Сервер проверяет данные. Если они содержат ошибку, то форма отображается заново, показывая ошибки. Если данные прошли проверку, сервер сохраняет текущее состояние мастера в бэкэнде и перенаправляет пользователя на следующую страницу.

source: Step 1 and 2 repeat, for every subsequent form in the wizard.
ru: Оба шага повторяются для каждой формы мастера.

source: Once the user has submitted all the forms and all the data has been validated, the wizard processes the data -- saving it to the database, sending an email, or whatever the application needs to do.
ru: После того, как пользователь заполнит все формы и все данные пройдут проверку, мастер обрабатывает данные, сохраняя их в базе данных, отправляя почту или производит другие требуемые действия.

source: Usage
ru: Использование

source: This application handles as much machinery for you as possible. Generally, you just have to do these things:
ru: Это приложение максимально автоматизирует данный процесс. В общем случае, вам надо сделать следующее:

source: Define a number of :class:`~django.forms.Form` classes -- one per wizard page.
ru: Определить ряд классов :class:`~django.forms.Form`, по одному на каждую страницу мастера.

source: Create a :class:`WizardView` subclass that specifies what to do once all of your forms have been submitted and validated. This also lets you override some of the wizard's behavior.
ru: Создать наследника класса :class:`WizardView`, который будет определять , что надо сделать когда все формы будут заполнены и проверены. Класс также позволяет изменить поведение мастера.

source: Create some templates that render the forms. You can define a single, generic template to handle every one of the forms, or you can define a specific template for each form.
ru: Создать несколько шаблонов, которые будут отображать формы. Вы можете определить либо один общий шаблон для обработки каждой формы, либо создать собственный шаблон для каждой формы.

source: Add ``django.contrib.formtools`` to your :setting:`INSTALLED_APPS` list in your settings file.
ru: Добавить ``django.contrib.formtools`` в параметр конфигурации :setting:`INSTALLED_APPS`.

source: Point your URLconf at your :class:`WizardView` :meth:`~WizardView.as_view` method.
ru: Зарегистрировать URL, который будет вызывать метод :meth:`~WizardView.as_view` вашего класса :class:`WizardView`.

source: Defining ``Form`` classes
ru: Определение классов ``Form``

source: The first step in creating a form wizard is to create the :class:`~django.forms.Form` classes. These should be standard :class:`django.forms.Form` classes, covered in the :doc:`forms documentation </topics/forms/index>`. These classes can live anywhere in your codebase, but convention is to put them in a file called :file:`forms.py` in your application.
ru: Первым шагом создания мастера форм будет определение классов :class:`~django.forms.Form`. Это обычные классы :class:`django.forms.Form`, описанные в :doc:`соответствующем разделе </topics/forms/index>`. Код этих классов может располагаться в любом месте вашего проекта, но по принятым соглашениям лучше его располагать в файле :file:`forms.py` вашего приложения.

source: For example, let's write a "contact form" wizard, where the first page's form collects the sender's email address and subject, and the second page collects the message itself. Here's what the :file:`forms.py` might look like::
ru: Давайте для примера напишем мастер для «контактной формы», где на первой странице будем запрашивать адрес электронной почты и тему, а на второй — само тело сообщения. Вот как файл :file:`forms.py` может выглядеть::

source: In order to use :class:`~django.forms.FileField` in any form, see the section :ref:`Handling files <wizard-files>` below to learn more about what to do.
ru: Для того, чтобы использовать класс :class:`~django.forms.FileField` на любой форме, обратитесь к расположенному далее разделу :ref:` Обработка файлов <wizard-files>`.

source: Creating a ``WizardView`` subclass
ru: Наследование ``WizardView``

source: The next step is to create a :class:`django.contrib.formtools.wizard.views.WizardView` subclass. You can also use the :class:`SessionWizardView` or :class:`CookieWizardView` classes which preselect the backend used for storing information during execution of the wizard (as their names indicate, server-side sessions and browser cookies respectively).
ru: Следующим шагом будет создание класса :class:`django.contrib.formtools.wizard.views.WizardView`. Вы можете также использовать классы :class:`SessionWizardView` или :class:`CookieWizardView`, которые используют соответствующий бэкэнд для хранения информации во время работы мастера (как видно по их именам, для хранения информации в сессии на сервере или в куках браузера).

source: To use the :class:`SessionWizardView` follow the instructions in the :doc:`sessions documentation </topics/http/sessions>` on how to enable sessions.
ru: Для использования класса :class:`SessionWizardView` следуйте инструкциям :doc:`документации по сессиям </topics/http/sessions>` для активации поддержки сессий.

source: The only requirement on this subclass is that it implement a :meth:`~WizardView.done()` method.
ru: Единственное требование к вашему классу — он должен реализовывать метод :meth:`~WizardView.done()`.

source: In this simplistic example, rather than performing any database operation, the method simply renders a template of the validated data::
ru: Это упрощённый пример. Вместо выполнения всех операций с базой данных, метод просто заполняет шаблон проверенными данными::

source: Note that this method will be called via ``POST``, so it really ought to be a good Web citizen and redirect after processing the data. Here's another example::
ru: Следует отметить, что этот метод будет выполняться через ``POST``, поэтому по правилам хорошего тона после обработки следует перенаправлять пользователя на другую страницу. Вот другой пример::

source: See the section :ref:`Advanced WizardView methods <wizardview-advanced-methods>` below to learn about more :class:`WizardView` hooks.
ru: Обратитесь к разделу :ref:`Дополнительные методы WizardView <wizardview-advanced-methods>` для получения информации по обработчикам класса :class:`WizardView`.

source: Creating templates for the forms
ru: Создание шаблонов для форм

source: Next, you'll need to create a template that renders the wizard's forms. By default, every form uses a template called :file:`formtools/wizard/wizard_form.html`. You can change this template name by overriding either the :attr:`~django.views.generic.base.TemplateResponseMixin.template_name` attribute or the :meth:`~django.views.generic.base.TemplateResponseMixin.get_template_names()` method, which are documented in the :class:`~django.views.generic.base.TemplateResponseMixin` documentation. The latter one allows you to use a different template for each form (:ref:`see the example below <wizard-template-for-each-form>`).
ru: Далее, необходимо создать шаблон для отображения форм мастера. По умолчанию каждая форма использует шаблон :file:`formtools/wizard/wizard_form.html`. Вы можете изменить имя этого шаблона, переопределив либо атрибут :attr:`~django.views.generic.base.TemplateResponseMixin.template_name`, либо метод :meth:`~django.views.generic.base.TemplateResponseMixin.get_template_names()`, которые описаны в документации на класс :class:`~django.views.generic.base.TemplateResponseMixin`. Последний класс позволяет использовать отдельные шаблоны для каждой формы (:ref:`см. примеры далее <wizard-template-for-each-form>`).

source: This template expects a ``wizard`` object that has various items attached to it:
ru: Шаблон ожидает объект ``wizard``, к которому привязаны различные элементы:

source: ``form`` -- The :class:`~django.forms.Form` or :class:`~django.forms.formsets.BaseFormSet` instance for the current step (either empty or with errors).
ru: ``form`` -- это экземпляр классов :class:`~django.forms.Form` или :class:`~django.forms.formset.BaseFormSet` для текущего шага мастера (либо пустой, либо с ошибками).

source: ``steps`` -- A helper object to access the various steps related data:
ru: ``steps`` -- вспомогательный объект для доступа к данным других шагов мастера:

source: ``step0`` -- The current step (zero-based).
ru: ``step0`` -- номер текущего шага (начинается с нуля).

source: ``step1`` -- The current step (one-based).
ru: ``step1`` -- номер текущего шага (начинается с единицы).

source: ``count`` -- The total number of steps.
ru: ``count`` -- общее количество шагов.

source: ``first`` -- The first step.
ru: ``first`` -- признак первого шага.

source: ``last`` -- The last step.
ru: ``last`` -- признак последнего шага.

source: ``current`` -- The current (or first) step.
ru: ``current`` -- текущий (или первый) шаг.

source: ``next`` -- The next step.
ru: ``next`` -- следующий шаг.

source: ``prev`` -- The previous step.
ru: ``prev`` -- предыдущий шаг.

source: ``index`` -- The index of the current step.
ru: ``index`` -- индекс текущего шага.

source: ``all`` -- A list of all steps of the wizard.
ru: ``all`` -- список всех шагов мастера.

source: You can supply additional context variables by using the :meth:`~WizardView.get_context_data` method of your :class:`WizardView` subclass.
ru: Вы можете добавлять в контекст дополнительные переменные с помощью метода :meth:`~WizardView.get_context_data` вашего потомка класса :class:`WizardView`.

source: Here's a full example template:
ru: Вот полный пример шаблона:

source: Note that ``{{ wizard.management_form }}`` **must be used** for the wizard to work properly.
ru: Следует отметить, что тег ``{{ wizard.management_form }}`` должен **обязательно присутствовать** в шаблоне, иначе мастер будет работать неправильно.

source: Hooking the wizard into a URLconf
ru: Подключение мастера к URL

source: Finally, we need to specify which forms to use in the wizard, and then deploy the new :class:`WizardView` object at a URL in the ``urls.py``. The wizard's ``as_view()`` method takes a list of your :class:`~django.forms.Form` classes as an argument during instantiation::
ru: Наконец, нам надо указать какие формы надо использовать в мастере и затем подключить новый объект :class:`WizardView` к URL в файле ``urls.py``. Метод мастера :meth:`as_view()` принимает список экземпляров класса :class:`~django.forms.Form` в качестве аргумента::

source: You can also pass the form list as a class attribute named ``form_list``::
ru: Вы можете также передать список форм через атрибут класса ``form_list``::

source: Using a different template for each form
ru: Использование различных шаблонов для каждой формы

source: As mentioned above, you may specify a different template for each form. Consider an example using a form wizard to implement a multi-step checkout process for an online store. In the first step, the user specifies a billing and shipping address. In the second step, the user chooses payment type. If they chose to pay by credit card, they will enter credit card information in the next step. In the final step, they will confirm the purchase.
ru: Как упоминалось ранее, вы можете указывать различные шаблоны для каждой формы. Рассмотрим пример использования мастера для реализации многошагового процесса покупки в интернет магазине. На первом шаге пользователь определяет адреса оплаты и доставки. На втором шаге. пользователь выбирает тип платежа. Если будет выбрана оплата с помощью кредитной карты, они введут информацию о карте на следующем шаге. На последнем шаге производится подтверждение покупки.

source: Here's what the view code might look like::
ru: Вот так может выглядеть код подобного представления::

source: The ``urls.py`` file would contain something like::
ru: Файл ``urls.py`` будет содержать нечто подобное::

source: Note that the ``OrderWizard`` object is initialized with a list of pairs. The first element in the pair is a string that corresponds to the name of the step and the second is the form class.
ru: Следует отметить, что объект ``OrderWizard`` инициализируется списком пар. Первым элементом пары является строка с именем шага, а вторая -- класс формы.

source: In this example, the :meth:`~django.views.generic.base.TemplateResponseMixin.get_template_names()` method returns a list containing a single template, which is selected based on the name of the current step.
ru: В данном примере метод :meth:`~django.views.generic.base.TemplateResponseMixin.get_template_names()` возвращает список единый шаблон, который был выбран по имени текущего шага.

source: Advanced ``WizardView`` methods
ru: Дополнительные методы ``WizardView``

source: Aside from the :meth:`~done()` method, :class:`WizardView` offers a few advanced method hooks that let you customize how your wizard works.
ru: Кроме метода :meth:`~done()`, класс :class:`WizardView` предоставляет несколько дополнительных методов (обработчиков), которые позволяют настроить поведение мастера.

source: Some of these methods take an argument ``step``, which is a zero-based counter as string representing the current step of the wizard. (E.g., the first form is ``'0'`` and the second form is ``'1'``)
ru: Некоторые из этих методов принимают аргумент ``step``, который является начинающимся с нуля строковым значением текущего шага мастера. (Т.е., первая форма — ``'0'``, а вторая — ``'1'``.)

source: Returns the prefix which will be used when calling the form for the given step. ``step`` contains the step name, ``form`` the form class which will be called with the returned prefix.
ru: Возвращает префикс, который будет использоваться при вызове формы для переданного шага. ``step`` содержит имя шага, ``form`` -- класс формы, который будет вызван с использованием возвращённого префикса.

source: If no ``step`` is given, it will be determined automatically. By default, this simply uses the step itself and the ``form`` parameter is not used.
ru: Если ``step`` не передан, то будет определён автоматически. По умолчанию будет использован сам шаг, а параметр ``form`` использоваться не будет.

source: For more, see the :ref:`form prefix documentation <form-prefix>`.
ru: Для подробностей обратитесь к :ref:`документации на префиксы форм <form-prefix>`.

source: Returns a dictionary which will be passed as the :attr:`~django.forms.Form.initial` argument when instantiating the Form instance for step ``step``. If no initial data was provided while initializing the form wizard, an empty dictionary should be returned.
ru: Возвращает словарь, который будет передан в качестве аргумента :attr:`~django.forms.Form.initial` при создании экземпляра формы для шага ``step``. Если во время создания мастера начальные данные не были предоставлены, то возвращается пустой словарь.

source: The default implementation::
ru: Стандартная реализация::

source: Returns a dictionary which will be used as the keyword arguments when instantiating the form instance on given ``step``.
ru: Возвращает словарь, который будет использоваться в качестве именованных аргументов при создании экземпляра формы для шага ``step``.

source: This method will be called only if a :class:`~django.forms.ModelForm` is used as the form for step ``step``.
ru: Этот метод применяется только при использовании класса :class:`~django.forms.ModelForm` для создания формы на шаге ``step``.

source: Returns an :class:`~django.db.models.Model` object which will be passed as the ``instance`` argument when instantiating the ``ModelForm`` for step ``step``. If no instance object was provided while initializing the form wizard, ``None`` will be returned.
ru: Возвращает объект :class:`~django.db.models.Model`, который передаётся в качестве аргумента ``instance`` при создании модельной формы на шаге ``step``. Если при создании мастера не был передан экземпляр модели, то возвращается ``None``.

source: Returns the template context for a step. You can overwrite this method to add more data for all or some steps. This method returns a dictionary containing the rendered form step.
ru: Возвращает шаблонный контекст для шага. Вы можете переопределить этот метод для добавления дополнительных данных на всех или на определённых шагах мастера. Этот метод возвращает словарь контекста для текущего шага.

source: The default template context variables are:
ru: Стандартные контекстные переменные шаблона:

source: Any extra data the storage backend has stored
ru: Бэкэнд хранения сохраняет все дополнительные данные

source: Example to add extra variables for a specific step::
ru: Пример добавления дополнительных переменных для указанного шага::

source: This method returns a prefix for use by the storage backends. Backends use the prefix as a mechanism to allow data to be stored separately for each wizard. This allows wizards to store their data in a single backend without overwriting each other.
ru: Этот метод возвращает префикс, который использует хранилище. Бэкэнд использует префикс для хранения данных нескольких мастеров в одном хранилище. Это позволяет мастерам сохранять свои данные, не мешая друг другу.

source: You can change this method to make the wizard data prefix more unique to, e.g. have multiple instances of one wizard in one session.
ru: Вы можете изменить этот метод, чтобы сделать префикс данных мастера более уникальным, т.е., чтобы позволить работать нескольким экземплярам одного мастера в рамках одной сессии.

source: Default implementation::
ru: Стандартная реализация::

source: This method constructs the form for a given ``step``. If no ``step`` is defined, the current step will be determined automatically. If you override ``get_form``, however, you will need to set ``step`` yourself using ``self.steps.current`` as in the example below. The method gets three arguments:
ru: Этот метод создает форму для указанного шага ``step``. Если шаг не указан, то текущий шаг определяется автоматически. Если вы переопределите ``get_form``, вам необходимо указать ``step`` самостоятельно, используя ``self.steps.current`` как показано ниже. Метод принимает три аргумента:

source: ``step`` -- The step for which the form instance should be generated.
ru: ``step`` -- шаг, для которого должен быть создан экземпляр формы.

source: ``data`` -- Gets passed to the form's data argument
ru: ``data`` -- передаётся в аргумент данных формы.

source: ``files`` -- Gets passed to the form's files argument
ru: ``files`` -- передаётся в аргумент файлов формы

source: You can override this method to add extra arguments to the form instance.
ru: Вы можете переопределить этот метод для передачи дополнительных аргументов в экземпляр формы.

source: Example code to add a user attribute to the form on step 2::
ru: Пример кода, который добавляет атрибут пользователя к форме на вопрос шаге.

source: Hook for modifying the wizard's internal state, given a fully validated :class:`~django.forms.Form` object. The Form is guaranteed to have clean, valid data.
ru: Обработчик для изменения внутреннего состояния мастера, получающий полностью проверенный объект :class:`~django.forms.Form`. Форма гарантированно получает нормализованные и проверенные данные.

source: This method gives you a way to post-process the form data before the data gets stored within the storage backend. By default it just returns the ``form.data`` dictionary. You should not manipulate the data here but you can use it to do some extra work if needed (e.g. set storage extra data).
ru: Этот метод позволяет организовать обработку данных формы перед их помещением в хранилище. По умолчанию метод просто возвращает словарь ``form.data``. Вы не должны изменять полученные данные, но можете дополнять их.

source: Note that this method is called every time a page is rendered for *all* submitted steps.
ru: Следует отметить, что этот метод вызывается при каждом отображении страницы для *всех* выполненных шагов.

source: This method gives you a way to post-process the form files before the files gets stored within the storage backend. By default it just returns the ``form.files`` dictionary. You should not manipulate the data here but you can use it to do some extra work if needed (e.g. set storage extra data).
ru: Этот метод предоставляет возможность организовать обработку файлов формы перед их размещением в хранилище. По умолчанию метод просто возвращает словарь ``form.files``. Вы не должны изменять полученные данные, но можете дополнять их.

source: This method is called when the step should be changed to something else than the next step. By default, this method just stores the requested step ``goto_step`` in the storage and then renders the new step.
ru: Этот метод вызывается когда шаг должен быть изменён на любой другой, кроме следующего. По-умолчанию, этот метод просто сохраняет запрошенный шаг ``goto_step`` в хранилище и затем отображает соответствующую форму.

source: If you want to store the entered data of the current step before rendering the next step, you can overwrite this method.
ru: Если требуется сохранить введённые данные текущего шага перед отображением следующего, вы можете переопределить этот метод.

source: When the wizard thinks all steps have passed it revalidates all forms with the data from the backend storage.
ru: Как только мастер пройдёт все шаги, он заново проверяет все формы, используя данные из хранилища.

source: If any of the forms don't validate correctly, this method gets called. This method expects two arguments, ``step`` and ``form``.
ru: Если хоть одна из форм не пройдёт проверку, то будет вызван этот метод. Метод принимает два аргумента, ``step`` и ``form``.

source: The default implementation resets the current step to the first failing form and redirects the user to the invalid form.
ru: Текущая реализация сбрасывает текущий шаг на первую из форм, которая не прошла проверку, и перенаправляет пользователя на неё.
