Repository: 43FUN/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/contrib/formtools/index.po
Languages: ru

source: A set of high-level abstractions for Django forms (:mod:`django.forms`).
ru: Набор абстракций высокого уровня для форм Django (:mod:`django.forms`).

source: Historically, Django shipped with ``django.contrib.formtools`` -- a collection of assorted utilities that are useful for specific form use cases. This code is now distributed separately from Django, for easier maintenance and to trim the size of Django's codebase. In Django 1.8, importing from ``django.contrib.formtools`` will no longer work.
ru: Ранее Django содержал приложение ``django.contrib.formtools`` -- набор утилит для работы с формами. Теперь этот код распространяется отдельно от Django, чтобы упростить поддержку и уменьшить количество кода Django. В Django 1.8 импорт из ``django.contrib.formtools`` больше не работает.

source: The new formtools package is named ``django-formtools``, with a main module called ``formtools``. Version 1.0 includes the same two primary features that the code included when it shipped with Django: a helper for form previews and a form wizard view.
ru: Новый пакет теперь называется ``django-formtools``, главный модуль которого называется ``formtools``. Версия 1.0 содержит две основные возможности, которые были доступны в Django: "превью" формы и "визард" форм.

source: See the `official documentation`_ for more information.
ru: Подробности смотрите в `официальной документации <http://django-formtools.readthedocs.org/en/latest/>`_.

source: How to migrate
ru: Как перейти на новое приложение

source: If you've used the old ``django.contrib.formtools`` package follow these two easy steps to update your code:
ru: Если вы используете старый пакет ``django.contrib.formtools``, для обновления выполните следующее:

source: Install version 1.0 of the third-party ``django-formtools`` package.
ru: Установите версию 1.0 пакета ``django-formtools``.

source: Change your app's import statements to reference the new packages.
ru: Замените импорты.

source: For example, change::
ru: Например, замените::

source: to::
ru: на::

source: The code in version 1.0 of the new package is the same (it was copied directly from Django), so you don't have to worry about backwards compatibility in terms of functionality. Only the imports have changed.
ru: Код версии 1.0 нового пакета не аналогичен (просто скопирован из Django), по этому вам не нужно волноваться о совместимости функционала. Поменялись только импорты.
