Repository: 43FUN/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/models/database-functions.po
Languages: ru

source: Database Functions
ru: Функции базы данных

source: The classes documented below provide a way for users to use functions provided by the underlying database as annotations, aggregations, or filters in Django. Functions are also :doc:`expressions <expressions>`, so they can be used and combined with other expressions like :ref:`aggregate functions <aggregation-functions>`.
ru: Классы, описанные далее, представляют пользователям Django способ работать с функционалом используемой базы данных в виде аннотаций, агрегаций или фильтров. Функции также являются :doc:`выражениями <expressions>`, следовательно они могут быть использованы и скомбинированы с другими выражениями как :ref:`функции агрегирования <aggregation-functions>`.

source: We'll be using the following model in examples of each function::
ru: Мы будем использовать в примерах каждой функции следующую модель::

source: We don't usually recommend allowing ``null=True`` for ``CharField`` since this allows the field to have two "empty values", but it's important for the ``Coalesce`` example below.
ru: Обычно мы не рекомендуем позволять ``null=True`` для ``CharField``, потому что получается, что у поля будет два "пустых значения", но для примера ``Coalesce`` это необходимо.

source: Accepts a list of at least two field names or expressions and returns the first non-null value (note that an empty string is not considered a null value). Each argument must be of a similar type, so mixing text and numbers will result in a database error.
ru: Принимает список, состоящий как минимум из двух имён полей или выражений, и возвращает первое не null значение (следует отметить, что пустые строки не рассматриваются как null значения). Аргументы должны быть одного типа, то есть смешивание текста и чисел ведёт к ошибке базы данных.

source: Usage examples::
ru: Примеры использования::

source: Accepts a list of at least two text fields or expressions and returns the concatenated text. Each argument must be of a text or char type. If you want to concatenate a ``TextField()`` with a ``CharField()``, then be sure to tell Django that the ``output_field`` should be a ``TextField()``. This is also required when concatenating a ``Value`` as in the example below.
ru: Принимает список, состоящий как минимум из двух имён полей или выражений, и возвращает соединённый текст. Аргументы должны быть текстом или символами. Есть требуется соединить содержимое ``TextField()`` с ``CharField()``, то укажите Django, что ``output_field`` должно быть ``TextField()``. Это также следует делать при соединении ``Value``, как показано ниже.

source: This function will never have a null result. On backends where a null argument results in the entire expression being null, Django will ensure that each null part is converted to an empty string first.
ru: Эта функция никогда не вернёт null. Для бэкендов, где null в качестве аргумента приводит к тому, что всё выражение становится null, Django выполняет преобразование каждого null аргумента в пустую строку.

source: Usage example::
ru: Пример использования::

source: Accepts a single text field or expression and returns the number of characters the value has. If the expression is null, then the length will also be null.
ru: Принимает одно текстовое поле или выражение и возвращает количество символов из которых состоит это выражение. Если выражение вычисляется в null, то значением также будет null.

source: Accepts a single text field or expression and returns the lowercase representation.
ru: Принимает одно текстовое поле или выражение и возвращает его значение в нижнем регистре.

source: Returns a substring of length ``length`` from the field or expression starting at position ``pos``. The position is 1-indexed, so the position must be greater than 0. If ``length`` is ``None``, then the rest of the string will be returned.
ru: Возвращает часть строки из ``length`` символов поля или выражения, начиная с позиции ``pos``. Позиция индексируется с единицы, таким образом, её значение должно быть больше нуля. Если в качестве ``length`` указан ``None``, то возвращается оставшаяся часть строки.

source: Accepts a single text field or expression and returns the uppercase representation.
ru: Принимает одно текстовое поле или выражение и возвращает его значение в верхнем регистре.
