Repository: 43FUN/django_documentation
Catalog: locale/*/LC_MESSAGES/releases/1.3.5.po
Languages: ru

source: Django 1.3.5 release notes
ru: О релизе Django 1.3.5

source: *December 10, 2012*
ru: *10 декабря 2012*

source: Django 1.3.5 addresses two security issues present in previous Django releases in the 1.3 series.
ru: Django 1.3.5 закрывает сразу 2 ошибки безопасности в предыдущих версиях ветки 1.3.

source: Please be aware that this security release is slightly different from previous ones. Both issues addressed here have been dealt with in prior security updates to Django. In one case, we have received ongoing reports of problems, and in the other we've chosen to take further steps to tighten up Django's code in response to independent discovery of potential problems from multiple sources.
ru: Имейте в виду, что этот релиз безопасности немного отличается от предыдущих. Обе ошибки были исправлены в предыдущих обновлениях Django. В одном случае мы получили постоянные сообщения о проблемах, а в другом мы решили предпринять дальнейшие шаги, чтобы обновить код Django в ответ на кучу сообщений о потенциальных проблемах из различных источников.

source: Host header poisoning
ru: Опасный заголовок Host

source: Several earlier Django security releases focused on the issue of poisoning the HTTP Host header, causing Django to generate URLs pointing to arbitrary, potentially-malicious domains.
ru: В прошлом релизе безопасности рассматривался вопрос об обработке заголовка Host у HTTP-запроса, в результате чего злоумышленник мог сгенерировать URL на свой сервер.

source: In response to further input received and reports of continuing issues following the previous release, we're taking additional steps to tighten Host header validation. Rather than attempt to accommodate all features HTTP supports here, Django's Host header validation attempts to support a smaller, but far more common, subset:
ru: В ответ на всё поступающие сообщения об ошибках мы решили ввести дополнительные ограничения на проверку заголовка Host. Вместо того, чтобы пытаться приспособить все возможности HTTP проверка Host в Django пытается поддерживать меньше, но гораздо более общее подмножество:

source: IP addresses -- both IPv4 and IPv6 -- are permitted.
ru: IP адреса -- как IPv4, так и IPv6 -- разрешены.

source: Port, if specified, is numeric.
ru: Порт, если указан, является числом.

source: Any deviation from this will now be rejected, raising the exception :exc:`django.core.exceptions.SuspiciousOperation`.
ru: В любых других случаях будет вызываться исключение :exc:`django.core.exceptions.SuspiciousOperation`.

source: Redirect poisoning
ru: Опасный редирект

source: Also following up on a previous issue: in July of this year, we made changes to Django's HTTP redirect classes, performing additional validation of the scheme of the URL to redirect to (since, both within Django's own supplied applications and many third-party applications, accepting a user-supplied redirect target is a common pattern).
ru: В дополнение к предыдущей проблеме: в июле мы внесли некоторые изменения в классы, отвечающие за HTTP редирект, которые выполняют дополнительную проверку URL. Это коснулось как внутренних механизмов, так и сторонних, которые используют общий шаблон перенаправлений.

source: Since then, two independent audits of the code turned up further potential problems. So, similar to the Host-header issue, we are taking steps to provide tighter validation in response to reported problems (primarily with third-party applications, but to a certain extent also within Django itself). This comes in two parts:
ru: Так что мы решили ввести 2 независимые проверки, дабы исключить будущие потенциальные проблемы. Это качается как сторонних приложений, так и внутренних механизмов Django.

source: 1. A new utility function, ``django.utils.http.is_safe_url``, is added; this function takes a URL and a hostname, and checks that the URL is either relative, or if absolute matches the supplied hostname. This function is intended for use whenever user-supplied redirect targets are accepted, to ensure that such redirects cannot lead to arbitrary third-party sites.
ru: 1. Добавлена новая функция ``django.utils.http.is_safe_url``, которая принимает URL и имя хоста и проверяет, что первый либо обносительный, либо включает в себя имя сайта. Эта функция предназначена для ситуации, когда пользователь получает URL для перенаправления, чтобы исключить переход на сторонний ресурс.

source: 2. All of Django's own built-in views -- primarily in the authentication system -- which allow user-supplied redirect targets now use ``is_safe_url`` to validate the supplied URL.
ru: Все встроенные представления -- в первую очередь в системе аутентификации -- которые используют перенаправление, используют ``is_safe_url`` для валидации адреса.
