Repository: 43FUN/django_documentation
Catalog: locale/*/LC_MESSAGES/releases/1.4.2.po
Languages: ru

source: Django 1.4.2 release notes
ru: Релиз Django 1.4.2

source: *October 17, 2012*
ru: *17 октября 2012*

source: This is the second security release in the Django 1.4 series.
ru: Это второй релиз безопасности в ветке Django 1.4.

source: Host header poisoning
ru: Уязвимость в заголовке хоста

source: Some parts of Django -- independent of end-user-written applications -- make use of full URLs, including domain name, which are generated from the HTTP Host header. Some attacks against this are beyond Django's ability to control, and require the web server to be properly configured; Django's documentation has for some time contained notes advising users on such configuration.
ru: В некоторых местах Django -- независимо от пользовательских приложений -- используют полный URL, включая имя домена, которое генерируется из HTTP заголовка Host. Отражение таких атак находится за пределами возможностей Django и требует правильно сконфигурированного web-сервера. В документации можно найти несколько заметок на этот счёт.

source: Django's own built-in parsing of the Host header is, however, still vulnerable, as was reported to us recently. The Host header parsing in Django 1.3.3 and Django 1.4.1 -- specifically, ``django.http.HttpRequest.get_host()`` -- was incorrectly handling username/password information in the header. Thus, for example, the following Host header would be accepted by Django when running on "validsite.com"::
ru: Встроенный обработчик заголовка Host по-прежнему уязвим, как нам и сообщалось ранее. В ``django.http.HttpRequest.get_host()`` в версиях Django 1.3.3 и 1.4.1 неверно обрабатывает информацию о логине/пароле пользователя. Например, следующий код вернёт "validsite.com"::

source: Using this, an attacker can cause parts of Django -- particularly the password-reset mechanism -- to generate and display arbitrary URLs to users.
ru: Пользуясь этим, злоумышленник может вызвать методы Django -- в частности восстановление пароля -- для создания и отображения произвольных URL-адреса для пользователей.

source: To remedy this, the parsing in ``HttpRequest.get_host()`` is being modified; Host headers which contain potentially dangerous content (such as username/password pairs) now raise the exception :exc:`django.core.exceptions.SuspiciousOperation`.
ru: Чтобы исключить такую возможность, был изменён ``HttpRequest.get_host()``. Теперь при разборе заголовка Host, который содержит потенциально опасный контент (например, имя пользователя или пароль) будет вызывать исключение :exc:`django.core.exceptions.SuspiciousOperation`.

source: Details of this issue were initially posted online as a `security advisory`_.
ru: Подробнее об этом изменении можно посмотреть в `security advisory`_.

source: Backwards incompatible changes
ru: Нарушение обратной совместимости

source: The newly introduced :class:`~django.db.models.GenericIPAddressField` constructor arguments have been adapted to match those of all other model fields. The first two keyword arguments are now verbose_name and name.
ru: Новые аргументы для конструктора :class:`~django.db.models.GenericIPAddressField` адаптированы таким образом, чтобы совпадали с остальными полями модели. Теперь два первых аргумента verbose_name и name.

source: Other bugfixes and changes
ru: Остальные исправления и изменения

source: Subclass HTMLParser only for appropriate Python versions (#18239).
ru: Подкласс HTMLParser использует соответствующую версию Python (#18239).

source: Added batch_size argument to qs.bulk_create() (#17788).
ru: Добавлен аргумент batch_size в qs.bulk_create() (#17788).

source: Fixed a small regression in the admin filters where wrongly formatted dates passed as url parameters caused an unhandled ValidationError (#18530).
ru: Исправлена небольшая регрессия в фильтрах админки, когда неправильно форматированная дата, которая передавалась как параметр, вызывала необработанное исключение ValidationError (#18530).

source: Fixed an endless loop bug when accessing permissions in templates (#18979)
ru: Исправлен бесконечный цикл при запросе доступа в шаблоне (#18979)

source: Fixed some Python 2.5 compatibility issues
ru: Исправлена совместимость с Python 2.5

source: Fixed an issue with quoted filenames in Content-Disposition header (#19006)
ru: Исправлена ошибка с экранированием имён файлов в заголовке Content-Disposition (#19006).

source: Made the context option in ``trans`` and ``blocktrans`` tags accept literals wrapped in single quotes (#18881).
ru: Контекстные опции для тегов ``trans`` и ``blocktrans`` теперь принимают строки в одинарных кавычках (#18881).

source: Numerous documentation improvements and fixes.
ru: Многочисленные улучшения и исправления документации.
