Repository: 43FUN/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/http/middleware.po
Languages: ru

source: Middleware
ru: Промежуточный слой (Middleware)

source: Middleware is a framework of hooks into Django's request/response processing. It's a light, low-level "plugin" system for globally altering Django's input or output.
ru: Промежуточный слой -- это механизм "хуков" для обработки запросов и ответов в Django. Это простая низкоуровневая система "плагинов", которая глобально влияет на ввод и вывод в Django.

source: Each middleware component is responsible for doing some specific function. For example, Django includes a middleware component, :class:`~django.contrib.auth.middleware.AuthenticationMiddleware`, that associates users with requests using sessions.
ru: Каждый компонент промежуточного слоя отвечает за определенный функционал. Например, Django предоставляет :class:`~django.contrib.auth.middleware.AuthenticationMiddleware`, который ассоциирует пользователей с запросом через сессию.

source: This document explains how middleware works, how you activate middleware, and how to write your own middleware. Django ships with some built-in middleware you can use right out of the box. They're documented in the :doc:`built-in middleware reference </ref/middleware>`.
ru: Этот раздел описывает как работают промежуточные слои, как активировать их, и как создать собственные. Django предоставляет набор встроенных промежуточных слоев, которые можно использовать в проекте. Они описаны в разделе о :doc:`встроенных промежуточных слоях </ref/middleware>`.

source: Activating middleware
ru: Подключение промежуточных слоёв

source: To activate a middleware component, add it to the :setting:`MIDDLEWARE_CLASSES` tuple in your Django settings.
ru: Чтобы подключить промежуточный слой, добавьте его в кортеж :setting:`MIDDLEWARE_CLASSES` в настройках Django.

source: In :setting:`MIDDLEWARE_CLASSES`, each middleware component is represented by a string: the full Python path to the middleware's class name. For example, here's the default value created by :djadmin:`django-admin startproject <startproject>`::
ru: В :setting:`MIDDLEWARE_CLASSES` каждый промежуточный слой представлен строкой: полный путь для импорта класса промежуточного слоя. Например, вот значение настройки по умолчанию для проекта, который создает :djadmin:`django-admin startproject <startproject>`::

source: A Django installation doesn't require any middleware — :setting:`MIDDLEWARE_CLASSES` can be empty, if you'd like — but it's strongly suggested that you at least use :class:`~django.middleware.common.CommonMiddleware`.
ru: Django не требует никаких промежуточных слоёв для своей работы — :setting:`MIDDLEWARE_CLASSES` может быть пустым — но мы настоятельно рекомендуем использовать хотя бы :class:`~django.middleware.common.CommonMiddleware`.

source: The order in :setting:`MIDDLEWARE_CLASSES` matters because a middleware can depend on other middleware. For instance, :class:`~django.contrib.auth.middleware.AuthenticationMiddleware` stores the authenticated user in the session; therefore, it must run after :class:`~django.contrib.sessions.middleware.SessionMiddleware`. See :ref:`middleware-ordering` for some common hints about ordering of Django middleware classes.
ru: Порядок :setting:`MIDDLEWARE_CLASSES` важен, т.к. один промежуточный слой может зависеть от другого. Например, :class:`~django.contrib.auth.middleware.AuthenticationMiddleware` сохраняет текущего пользователя в сессии, поэтому должен срабатывать после :class:`~django.contrib.sessions.middleware.SessionMiddleware`. Смотрите советы, как лучше упорядочить промежуточные слои, в :ref:`middleware-ordering`.

source: Hooks and application order
ru: "Хуки" и порядок обработки

source: During the request phase, before calling the view, Django applies middleware in the order it's defined in :setting:`MIDDLEWARE_CLASSES`, top-down. Two hooks are available:
ru: Во время обработки запроса, перед вызовом представления, Django применяет промежуточные слои в порядке указанном в :setting:`MIDDLEWARE_CLASSES`, сверху вниз. Доступны два "хука":

source: During the response phase, after calling the view, middleware are applied in reverse order, from the bottom up. Three hooks are available:
ru: На этапе обработки ответа, после вызова представления, промежуточные слои применяются в обратном порядке, снизу вверх. Доступны три "хука":

source: :meth:`process_exception` (only if the view raised an exception)
ru: :meth:`process_exception` (только, если представление вызвало исключение)

source: :meth:`process_template_response` (only for template responses)
ru: :meth:`process_template_response` (только для ответа с шаблоном)

source: If you prefer, you can also think of it like an onion: each middleware class is a "layer" that wraps the view.
ru: Можете смотреть на это, как на луковицу: каждый промежуточный слой оборачивает представление.

source: The behavior of each hook is described below.
ru: Поведение каждого "хука" описано ниже.

source: Writing your own middleware
ru: Создание собственного промежуточного слоя

source: Writing your own middleware is easy. Each middleware component is a single Python class that defines one or more of the following methods:
ru: Создать свой промежуточный слой очень просто. Это просто класс Python, который предоставляет один или несколько методов:

source: ``request`` is an :class:`~django.http.HttpRequest` object.
ru: ``request`` -- это объект :class:`~django.http.HttpRequest`.

source: ``process_request()`` is called on each request, before Django decides which view to execute.
ru: ``process_request()`` вызывается для каждого запроса перед тем, как Django решит какое представление вызывать.

source: It should return either ``None`` or an :class:`~django.http.HttpResponse` object. If it returns ``None``, Django will continue processing this request, executing any other ``process_request()`` middleware, then, ``process_view()`` middleware, and finally, the appropriate view. If it returns an :class:`~django.http.HttpResponse` object, Django won't bother calling any other request, view or exception middleware, or the appropriate view; it'll apply response middleware to that :class:`~django.http.HttpResponse`, and return the result.
ru: Метод должен вернуть ``None`` или объект an :class:`~django.http.HttpResponse`. Если вернул ``None``, Django продолжит обработку запроса, вызывая ``process_request()`` других промежуточных слоёв, затем метод ``process_view()`` промежуточного слоя, и в конце представление. Если вернул объект :class:`~django.http.HttpResponse`, Django остановит обработку запроса, применит промежуточные слои для объекта :class:`~django.http.HttpResponse`, и вернет результат.

source: ``request`` is an :class:`~django.http.HttpRequest` object. ``view_func`` is the Python function that Django is about to use. (It's the actual function object, not the name of the function as a string.) ``view_args`` is a list of positional arguments that will be passed to the view, and ``view_kwargs`` is a dictionary of keyword arguments that will be passed to the view. Neither ``view_args`` nor ``view_kwargs`` include the first view argument (``request``).
ru: ``request`` -- объект :class:`~django.http.HttpRequest`. ``view_func``-- функция представления, которую Django собирается вызвать бля обработки запроса. (Это объект функции, а не название.) ``view_args`` -- список позиционных аргументов, которые будут переданы в функцию представления, ``view_kwargs`` -- словарь именованных аргументов. Ни ``view_args``, ни ``view_kwargs`` не включают первый аргумент представления (``request``).

source: ``process_view()`` is called just before Django calls the view.
ru: ``process_view()`` вызывается непосредственно перед вызовом представления.

source: It should return either ``None`` or an :class:`~django.http.HttpResponse` object. If it returns ``None``, Django will continue processing this request, executing any other ``process_view()`` middleware and, then, the appropriate view. If it returns an :class:`~django.http.HttpResponse` object, Django won't bother calling any other view or exception middleware, or the appropriate view; it'll apply response middleware to that :class:`~django.http.HttpResponse`, and return the result.
ru: Метод должен вернуть ``None`` или объект :class:`~django.http.HttpResponse`. Если вернул ``None``, Django продолжит обработку запроса, вызывая ``process_view()`` других промежуточных слоёв, а затем представление. Если вернул объект :class:`~django.http.HttpResponse`, Django остановит обработку запроса, применит промежуточные слои для объекта :class:`~django.http.HttpResponse`, и вернет результат.

source: Accessing :attr:`request.POST <django.http.HttpRequest.POST>` or :attr:`request.REQUEST <django.http.HttpRequest.REQUEST>` inside middleware from ``process_request`` or ``process_view`` will prevent any view running after the middleware from being able to :ref:`modify the upload handlers for the request <modifying_upload_handlers_on_the_fly>`, and should normally be avoided.
ru: Обращение к :attr:`request.POST <django.http.HttpRequest.POST>` или :attr:`request.REQUEST <django.http.HttpRequest.REQUEST>` в промежуточном слое в методе ``process_request`` или ``process_view``, не позволит в представлении :ref:`изменять обработчики загрузки файлов <modifying_upload_handlers_on_the_fly>`. Мы советуем так не делать.

source: The :class:`~django.middleware.csrf.CsrfViewMiddleware` class can be considered an exception, as it provides the :func:`~django.views.decorators.csrf.csrf_exempt` and :func:`~django.views.decorators.csrf.csrf_protect` decorators which allow views to explicitly control at what point the CSRF validation should occur.
ru: Класс :class:`~django.middleware.csrf.CsrfViewMiddleware` можно считать исключением, т.к. он предоставляет декораторы :func:`~django.views.decorators.csrf.csrf_exempt` и :func:`~django.views.decorators.csrf.csrf_protect`, которые позволяют представлениям явно контролировать на каком этапе выполнять CSRF проверку.

source: ``request`` is an :class:`~django.http.HttpRequest` object. ``response`` is the :class:`~django.template.response.TemplateResponse` object (or equivalent) returned by a Django view or by a middleware.
ru: ``request`` -- объект :class:`~django.http.HttpRequest`. ``response`` -- объект :class:`~django.template.response.TemplateResponse` (или аналогичный), который вернуло представление или промежуточный слой.

source: ``process_template_response()`` is called just after the view has finished executing, if the response instance has a ``render()`` method, indicating that it is a :class:`~django.template.response.TemplateResponse` or equivalent.
ru: ``process_template_response()`` вызывается после выполнение представления, если объект ответа содержит метож ``render()``, что указывает на :class:`~django.template.response.TemplateResponse` или аналог.

source: It must return a response object that implements a ``render`` method. It could alter the given ``response`` by changing ``response.template_name`` and ``response.context_data``, or it could create and return a brand-new :class:`~django.template.response.TemplateResponse` or equivalent.
ru: Этот метод должен вернуть объект ответа, который содержит метод ``render``. Он может изменить переданный объект ``response``, изменив ``response.template_name`` или ``response.context_data``, или же создать новый экземпляр класса :class:`~django.template.response.TemplateResponse` или аналогичного.

source: You don't need to explicitly render responses -- responses will be automatically rendered once all template response middleware has been called.
ru: Нет необходимости явно рендерить объекты ответов -- они будут автоматически отрендерены после выполнения всех промежуточных слоёв.

source: Middleware are run in reverse order during the response phase, which includes ``process_template_response()``.
ru: Промежуточные слои выполняются в обратном порядке при обработке ответа, это относится и к методу ``process_template_response()``.

source: ``request`` is an :class:`~django.http.HttpRequest` object. ``response`` is the :class:`~django.http.HttpResponse` or :class:`~django.http.StreamingHttpResponse` object returned by a Django view or by a middleware.
ru: ``request`` -- объект :class:`~django.http.HttpRequest`. ``response`` -- объект :class:`~django.http.HttpResponse` или :class:`~django.http.StreamingHttpResponse`, которые вернуло представление или промежуточный слой.

source: ``process_response()`` is called on all responses before they're returned to the browser.
ru: ``process_response()`` вызывается для каждого ответа перед тем, как он будет оптравлен браузеру.

source: It must return an :class:`~django.http.HttpResponse` or :class:`~django.http.StreamingHttpResponse` object. It could alter the given ``response``, or it could create and return a brand-new :class:`~django.http.HttpResponse` or :class:`~django.http.StreamingHttpResponse`.
ru: Этот метод должен вернуть объект :class:`~django.http.HttpResponse` или :class:`~django.http.StreamingHttpResponse`. Он может изменить переданный ``response``, или же создать и вернуть новый экземпляр :class:`~django.http.HttpResponse` или :class:`~django.http.StreamingHttpResponse`.

source: Unlike the ``process_request()`` and ``process_view()`` methods, the ``process_response()`` method is always called, even if the ``process_request()`` and ``process_view()`` methods of the same middleware class were skipped (because an earlier middleware method returned an :class:`~django.http.HttpResponse`). In particular, this means that your ``process_response()`` method cannot rely on setup done in ``process_request()``.
ru: В отличии от методов ``process_request()`` и ``process_view()``, метод ``process_response()`` вызывается всегда, даже если методы ``process_request()`` и ``process_view()`` этого промежуточного слоя были пропущены (т.к. предыдущий промежуточный слой вернул объект :class:`~django.http.HttpResponse`). Это означает, что метод ``process_response()`` не может полагаться на действия, выполняемые в ``process_request()``.

source: Finally, remember that during the response phase, middleware are applied in reverse order, from the bottom up. This means classes defined at the end of :setting:`MIDDLEWARE_CLASSES` will be run first.
ru: И не забывайте, что при обработке ответа промежуточные слои выполняются в обратном порядке -- снизу вверх. Это значит, что классы, указанные в конце :setting:`MIDDLEWARE_CLASSES`, будет выполнены в первую очередь.

source: Dealing with streaming responses
ru: Работа с потоковыми ответами

source: Unlike :class:`~django.http.HttpResponse`, :class:`~django.http.StreamingHttpResponse` does not have a ``content`` attribute. As a result, middleware can no longer assume that all responses will have a ``content`` attribute. If they need access to the content, they must test for streaming responses and adjust their behavior accordingly::
ru: В отличии от :class:`~django.http.HttpResponse` :class:`~django.http.StreamingHttpResponse` не содержит атрибут ``content``. По этому промежуточные слои больше не могут полагаться на то, что все объекта ответа будут содержать атрибут ``content``. По этому необходимо проверять тип ответа::

source: ``streaming_content`` should be assumed to be too large to hold in memory. Response middleware may wrap it in a new generator, but must not consume it. Wrapping is typically implemented as follows::
ru: Подразумевается, что ``streaming_content`` слишком большой, чтобы храниться в памяти. Промежуточный слой может обернуть его в новый генератор, но не загружать его полностью. Генератор-обертка обычно выглядит следующим образом::

source: ``request`` is an :class:`~django.http.HttpRequest` object. ``exception`` is an ``Exception`` object raised by the view function.
ru: ``request`` -- объект :class:`~django.http.HttpRequest`. ``exception`` -- ``Exception``, вызванное функцией представления.

source: Django calls ``process_exception()`` when a view raises an exception. ``process_exception()`` should return either ``None`` or an :class:`~django.http.HttpResponse` object. If it returns an :class:`~django.http.HttpResponse` object, the template response and response middleware will be applied, and the resulting response returned to the browser. Otherwise, default exception handling kicks in.
ru: Django вызывает ``process_exception()``, если представление вызывало исключение. ``process_exception()`` должен возвращать ``None`` или объект :class:`~django.http.HttpResponse`. Если вернул объект :class:`~django.http.HttpResponse`, будет выполнена обработка ответа промежуточными слоями и результат отправится браузеру. Если вернул ``None``, будет выполнена стандартная обработка исключений.

source: Again, middleware are run in reverse order during the response phase, which includes ``process_exception``. If an exception middleware returns a response, the middleware classes above that middleware will not be called at all.
ru: При обработке ответа промежуточные слои применяются в обратном порядке, это относится и к методу ``process_exception``. Если этот метод вернул объект ответа, промежуточные слои выше будут пропущены.

source: Most middleware classes won't need an initializer since middleware classes are essentially placeholders for the ``process_*`` methods. If you do need some global state you may use ``__init__`` to set up. However, keep in mind a couple of caveats:
ru: Большинство классов промежуточного слоя не требуют инициализации т.к. по сути являют набором ``process_*`` методов. Если вам необходимо какое-то глобальное состояние, вы можете использовать метод ``__init__`` для его инициализации. Однако помните о некоторых моментах:

source: Django initializes your middleware without any arguments, so you can't define ``__init__`` as requiring any arguments.
ru: Django инициализирует промежуточный слой без аргументов, по этому метод ``__init__`` не должен определять обязательные аргументы.

source: Unlike the ``process_*`` methods which get called once per request, ``__init__`` gets called only *once*, when the Web server responds to the first request.
ru: В отличии от методов ``process_*``, которые вызываются при каждом запросе, ``__init__`` вызывается только *один раз*, когда Web-сервер принимает первый запрос.

source: Marking middleware as unused
ru: Помечаем промежуточный слой как неиспользуемый

source: It's sometimes useful to determine at run-time whether a piece of middleware should be used. In these cases, your middleware's ``__init__`` method may raise :exc:`django.core.exceptions.MiddlewareNotUsed`. Django will then remove that piece of middleware from the middleware process and a debug message will be logged to the ``django.request`` logger when :setting:`DEBUG` is set to ``True``.
ru: Иногда полезно в процессе работы приложения указать, что промежуточный слой не должен использоваться. В таком случае в методе ``__init__`` можно вызывать исключение :exc:`django.core.exceptions.MiddlewareNotUsed`. Django исключит этот промежуточный слой из процесса обработки и запишет отладочное сообщение в логгер ``django.request``, если :setting:`DEBUG` равна ``True``.

source: Previously, :exc:`~django.core.exceptions.MiddlewareNotUsed` exceptions weren't logged.
ru: Ранее исключение :exc:`~django.core.exceptions.MiddlewareNotUsed` не логгировалось.

source: Guidelines
ru: Советы

source: Middleware classes don't have to subclass anything.
ru: Класс промежуточного слоя не должен наследоваться от другого класса.

source: The middleware class can live anywhere on your Python path. All Django cares about is that the :setting:`MIDDLEWARE_CLASSES` setting includes the path to it.
ru: Класс может находиться где угодно в путях Python. Главное указать путь к нему в :setting:`MIDDLEWARE_CLASSES`.

source: Feel free to look at :doc:`Django's available middleware </ref/middleware>` for examples.
ru: Вы можете найти примеры кода в :doc:`промежуточных слоях Django</ref/middleware>`.

source: If you write a middleware component that you think would be useful to other people, contribute to the community! :doc:`Let us know </internals/contributing/index>`, and we'll consider adding it to Django.
ru: Если вы создали полезный промежуточный слой, поделитесь ним с сообществом! :doc:`Напишите нам </internals/contributing/index>`, и возможно мы добавим его в Django.
