Repository: 43FUN/django_documentation
Catalog: locale/*/LC_MESSAGES/internals/release-process.po
Languages: ru

source: Django's release process
ru: Процесс выпуска Django

source: Official releases
ru: Официальные релизы

source: Since version 1.0, Django's release numbering works as follows:
ru: Начиная с версии 1.0, версии Django нумеруются следующим образом:

source: Versions are numbered in the form ``A.B`` or ``A.B.C``.
ru: Номер версии выглядит как ``A.B`` или ``A.B.C``.

source: ``A`` is the *major version* number, which is only incremented for major changes to Django, and these changes are not necessarily backwards-compatible. That is, code you wrote for Django 1.6 may break when we release Django 2.0.
ru: ``A`` - *мажорный* номер версии, который увеличивается только при существенных изменениях, которые не совместимы с предыдущими релизами. Так, например, код для Django 1.6 может не запуститься под Django 2.0.

source: ``B`` is the *minor version* number, which is incremented for large yet backwards compatible changes. Code written for Django 1.6 will continue to work under Django 1.7. Exceptions to this rule will be listed in the release notes.
ru: ``B`` - *минорный* номер версии, который увеличивается при большом объёме изменений, совместимых с предыдущими релизами. Код для Django 1.6 будет продолжать работать и под Django 1.7; исключения описаны в замечаниях к релизам.

source: ``C`` is the *micro version* number, which is incremented for bug and security fixes. A new micro-release will be 100% backwards-compatible with the previous micro-release. The only exception is when a security issue can't be fixed without breaking backwards-compatibility. If this happens, the release notes will provide detailed upgrade instructions.
ru: ``C`` - *микро* номер версии, который увеличивается по мере выпусков баг-фиксов. Он на 100% совместим с предыдущим выпуском, за исключением тех случаев, когда исправление безопасности невозможно без ёё нарушения. В любом случае это указано в замечании к релизу, в котором также приводятся рекомендации для обновления.

source: Before a new minor release, we'll make alpha, beta, and release candidate releases. These are of the form ``A.B alpha/beta/rc N``, which means the ``Nth`` alpha/beta/release candidate of version ``A.B``.
ru: Перед выпуском минорного релиза мы готовим альфа, бета и RC версии. Они обозначаются как ``A.B alpha/beta/rc N``, где ``Nth`` - alpha/beta/rc версия ``A.B``.

source: In git, each Django release will have a tag indicating its version number, signed with the Django release key. Additionally, each release series has its own branch, called ``stable/A.B.x``, and bugfix/security releases will be issued from those branches.
ru: В git каждый релиз Django имеет свой тег, определяющий его номер, подписанный ключом. Также в репозитории каждый релиз находится в отдельной ветке под названием ``stable/A.B.x``, а багфиксы выпускаются на основании уже этой ветки.

source: For more information about how the Django project issues new releases for security purposes, please see :doc:`our security policies <security>`.
ru: Подробнее о том, как подготавливаются релизы безопасности можно прочитать в :doc:`our security policies <security>`.

source: Major releases (1.0, 2.0, etc.) will happen very infrequently (think "years", not "months"), and may represent major, sweeping changes to Django.
ru: Мажорные релизы (1.0, 2.0...) очень редки и отражают серьёзные изменения в Django.

source: Minor release (1.5, 1.6, etc.) will happen roughly every nine months -- see `release process`_, below for details. These releases will contain new features, improvements to existing features, and such.
ru: Минорные релизы (1.5, 1.6...) выходят каждые 9 месяцев согласно `release process`_. В них добавляются новые возможности, всяческие улучшения и пр.

source: A minor release may deprecate certain features from previous releases. If a feature is deprecated in version ``A.B``, it will continue to work in versions ``A.B`` and ``A.B+1`` but raise warnings. It will be removed in version ``A.B+2``.
ru: В минорных релизах некоторые функции могут быть объявлены устаревшими. Если какая-то функциональность объявлена устаревшей в ``A.B``, она будет работать в ``A.B``, в ``A.B+1`` вызывать исключение, а в ``A.B+2`` уже удалена.

source: Micro releases (1.5.1, 1.6.2, 1.6.1, etc.) will be issued as needed, often to fix security issues.
ru: Минорные релизы (1.5.1, 1.6.2, 1.6.1...) будут выпускаться по мере надобности, зачастую исправляя ошибки в безопасности.

source: These releases will be 100% compatible with the associated minor release, unless this is impossible for security reasons. So the answer to "should I upgrade to the latest micro release?" will always be "yes."
ru: Эти релизы на 100% совместимы с минорными версиями, если это не противоречит вопросам безопасности. Так что вы всегда можете обновляться без сомнений.

source: Supported versions
ru: Поддерживаемые версии

source: At any moment in time, Django's developer team will support a set of releases to varying levels:
ru: В любой момент разработчики Django в той или иной степени поддерживают ряд релизов:

source: The current development master will get new features and bug fixes requiring major refactoring.
ru: Все новые возможности, а также рефакторинг и исправление ошибок, будут внесены в текущую ветку разработки.

source: Patches applied to the master branch must also be applied to the last minor release, to be released as the next micro release, when they fix critical problems:
ru: Патчи, применяемые к основной ветке разработки, портируются в последний минорный релиз, порождая следующий минорный релиз, который исправляет следующие проблемы:

source: Security issues.
ru: Вопросы безопасности.

source: Data-loss bugs.
ru: Ошибки, ведущие к потере данных.

source: Crashing bugs.
ru: Падения приложения.

source: Major functionality bugs in newly-introduced features.
ru: Опасные ошибки в новой функциональности.

source: The rule of thumb is that fixes will be backported to the last minor release for bugs that would have prevented a release in the first place (release blockers).
ru: Согласно правилам, исправления будут портированы в последний минорный релиз, если ошибка является блокирующей дальнейшую разработку.

source: Security fixes will be applied to the current master and the previous two minor releases.
ru: Исправления безопасности применяются к текущему релизу, а также к двум предыдущим минорным.

source: Committers may choose to backport bugfixes at their own discretion, provided they do not introduce backwards incompatibilities.
ru: Комиттер в праве выбирать какие исправления должны быть в ранних версиях, однако это не должно поломать обратную совместимость.

source: Documentation fixes generally will be more freely backported to the last release branch. That's because it's highly advantageous to have the docs for the last release be up-to-date and correct, and the risk of introducing regressions is much less of a concern.
ru: Исправления документации очень часто переносятся в ветку последнего релиза. Происходит это потому что выгодно иметь свежую и правильную документацию последнего выпуска, а риск проявления регрессии ничтожно мал.

source: As a concrete example, consider a moment in time halfway between the release of Django 1.6 and 1.7. At this point in time:
ru: Рассмотрим конкретный пример, когда мы находимся на полпути от Django 1.6 к Django 1.7:

source: Features will be added to development master, to be released as Django 1.7.
ru: Новая функциональность добавляется в master-ветку разработки Django 1.7.

source: Critical bug fixes will be applied to the ``stable/1.6.x`` branch, and released as 1.6.1, 1.6.2, etc.
ru: Исправление критических ошибок будет применено к ветке ``stable/1.6.x`` и выпущено под версиями 1.6.1, 1.6.2...

source: Security fixes will be applied to ``master``, to the ``stable/1.6.x`` branch, and to the ``stable/1.5.x`` branch. They will trigger the release of ``1.6.1``, ``1.5.1``, etc.
ru: Исправления безопасности будет применено к веткам ``master``, ``stable/1.6.x`` и ``stable/1.5.x``. Это послужит поводом к выпуску ``1.6.1``, ``1.5.1`` и др.

source: Documentation fixes will be applied to master, and, if easily backported, to the ``1.6.x`` branch. Bugfixes may also be backported.
ru: Исправления документации будет применено к текущей ветке и, если это не трудно, к ``1.6.x``. Вместе с ними могут перенести также исправления некоторых ошибок.

source: Release process
ru: Процесс выпуска

source: Django uses a time-based release schedule, with minor (i.e. 1.6, 1.7, etc.) releases every nine months, or more, depending on features.
ru: У Django есть расписание выпуска минорных (1.6, 1.7...) релизов, согласно которому это происходит каждые 9 месяцев или больше в зависимости от новой функциональности.

source: After each release, and after a suitable cooling-off period of a few weeks, the core development team will examine the landscape and announce a timeline for the next release. Most releases will be scheduled in the 6-9 month range, but if we have bigger features to development we might schedule a longer period to allow for more ambitious work.
ru: После каждого релиза происходит несколько недель затишья, в течении которых разработчики ядра готовят план и дорожную карту для следующего релиза. Большинство изменений укладываются в 6-9 месяцев, но из-за некоторых больших работ эти сроки могут увеличиться.

source: Release cycle
ru: Цикл релиза

source: Each release cycle will be split into three periods, each lasting roughly one-third of the cycle:
ru: Каждый цикл разделён на 3 периода, которые примерно равны по времени:

source: Phase one: feature proposal
ru: Фаза первая: предложение новой функциональности

source: The first phase of the release process will be devoted to figuring out what features to include in the next version. This should include a good deal of preliminary work on those features -- working code trumps grand design.
ru: Сначала согласовывают список нововведений, которые появятся в следующем релизе. Проводится большой объём предварительных работ по определению действительно необходимой функциональности.

source: At the end of part one, the core developers will propose a feature list for the upcoming release. This will be broken into:
ru: В конце концов разработчики ядра предлагают такой список, который разделён на следующие категории:

source: "Must-have": critical features that will delay the release if not finished
ru: "Must-have": критическая функциональность, без которой релиз не выйдет

source: "Maybe" features: that will be pushed to the next release if not finished
ru: "Maybe": работа по этим пунктам может быть перенесена на потом.

source: "Not going to happen": features explicitly deferred to a later release.
ru: "Not going to happen": работа по этим пунктам будет перенесена на потом.

source: Phase two: development
ru: Фаза вторая: разработка

source: The second third of the release schedule is the "heads-down" working period. Using the roadmap produced at the end of phase one, we'll all work very hard to get everything on it done.
ru: Вторая треть времени посвящена непосредственно работе согласно дорожной карте, которая была разработана на первом шаге.

source: Longer release schedules will likely spend more than a third of the time in this phase.
ru: Увеличение времени выхода как правило связано именно с этой фазой.

source: At the end of phase two, any unfinished "maybe" features will be postponed until the next release. Though it shouldn't happen, any "must-have" features will extend phase two, and thus postpone the final release.
ru: В конце второй фазы незавершённые "maybe" фичи будут перенесены в следующий релиз. Функциональность из списка "must-have" является обязательной, что может увеличить время выхода релиза.

source: Phase two will culminate with an alpha release. At this point, the ``stable/A.B.x`` branch will be forked from ``master``.
ru: Результатом разработки становится создание ветки ``stable/A.B.x``, которая отделяется от ``master``.

source: Phase three: bugfixes
ru: Фаза третья: исправление ошибок

source: The last third of a release cycle is spent fixing bugs -- no new features will be accepted during this time. We'll try to release a beta release after one month and a release candidate after two months.
ru: Последняя треть цикла тратится на исправление ошибок -- никакая новая функциональность более не принимается. Мы стараемся выпустить бета-версию через месяц, а RC спустя ещё один.

source: The release candidate marks the string freeze, and it happens at least two weeks before the final release. After this point, new translatable strings must not be added.
ru: Выпуск RC замораживает строковые константы, это случается как минимум за 2 недели до выпуска релиза. После этого новые переводы строк не принимаются.

source: During this phase, committers will be more and more conservative with backports, to avoid introducing regressions. After the release candidate, only release blockers and documentation fixes should be backported.
ru: В течении этой фазы разработчики становятся всё более консервативными в применении патчей, чтобы избежать регрессии. После выпуска RC принимаются только исправления блокирующих ошибок и документации.

source: In parallel to this phase, ``master`` can receive new features, to be released in the ``A.B+1`` cycle.
ru: В это же время в ветке ``master`` может начать появляться новая функциональность, которая будет рассмотрена в цикле релиза ``A.B+1``.

source: Bug-fix releases
ru: Релизы исправлений

source: After a minor release (e.g. 1.6), the previous release will go into bugfix mode.
ru: После выпуска нового минорного релиза (например, 1.6), предыдущий переводится в состояние принятия исправлений.

source: A branch will be created of the form ``stable/1.5.x`` to track bugfixes to the previous release. Critical bugs fixed on master must *also* be fixed on the bugfix branch; this means that commits need to cleanly separate bug fixes from feature additions. The developer who commits a fix to master will be responsible for also applying the fix to the current bugfix branch.
ru: Ветка для исправлений будет расти от ``stable/1.5.x``. Критические ошибки, исправленные в основной ветке, также *должны* быть исправлены в таких ветках для исправлений. Разработчик, который исправляет ошибку в основной ветке ответственен за портирование патча во все другие.

source: How this all fits together
ru: Как всё это сходится?

source: Let's look at a hypothetical example for how this all first together. Imagine, if you will, a point about halfway between 1.5 and 1.6. At this point, development will be happening in a bunch of places:
ru: Давайте рассмотрим гипотетический пример того, как же всё это работает. Предположим, что мы находимся на полпути от 1.5 до 1.6. В этом случае разработка будет вестись в куче мест:

source: On master, development towards 1.6 proceeds with small additions, bugs fixes, etc. being checked in daily.
ru: В основной ветке, где ведётся разработка 1.6. Там появляются дополнения, исправления ошибок, и пр., так что ветка обновляется каждый день.

source: On the branch ``stable/1.5.x``, fixes for critical bugs found in the 1.5 release are checked in as needed. At some point, this branch will be released as "1.5.1", "1.5.2", etc.
ru: В ветке ``stable/1.5.x``, если в релизе 1.5 обнаружены критические ошибки. Это породит выпуск "1.5.1", "1.5.2" и так далее.

source: On the branch ``stable/1.4.x``, security fixes are made if needed and released as "1.4.2", "1.4.3", etc.
ru: В ветке ``stable/1.4.x`` будут появляться только исправления безопасности под названиями "1.4.2", "1.4.3" и так далее.

source: Development of major features is done in branches in forks of the main repository. These branches will be merged into ``master`` before "1.6 alpha 1".
ru: Разработка новой функциональности ведётся в своей ветке. Они будут объединены в ``master`` перед выпуском "1.6 alpha 1".
