Repository: 43FUN/django_documentation
Catalog: locale/*/LC_MESSAGES/intro/tutorial04.po
Languages: ru

source: Writing your first Django app, part 4
ru: Создаем свое первое приложение с Django, часть 4

source: This tutorial begins where :doc:`Tutorial 3 </intro/tutorial03>` left off. We're continuing the Web-poll application and will focus on simple form processing and cutting down our code.
ru: Этот раздел -- продолжение :doc:`Части 3 </intro/tutorial02>` учебника. Мы продолжим разрабатывать приложение для голосования и сосредоточимся на обработке форм и упрощении нашего кода.

source: Write a simple form
ru: Создадим простую форму

source: Let's update our poll detail template ("polls/detail.html") from the last tutorial, so that the template contains an HTML ``<form>`` element:
ru: Отредактируем шаблон страницы опроса ("polls/detail.html") из предыдущего раздела учебника, и добавим HTML элемент ``<form>``:

source: A quick rundown:
ru: Краткий обзор:

source: ``forloop.counter`` indicates how many times the :ttag:`for` tag has gone through its loop
ru: ``forloop.counter`` содержит номер итерации цикла тега :ttag:`for`

source: Since we're creating a POST form (which can have the effect of modifying data), we need to worry about Cross Site Request Forgeries. Thankfully, you don't have to worry too hard, because Django comes with a very easy-to-use system for protecting against it. In short, all POST forms that are targeted at internal URLs should use the :ttag:`{% csrf_token %}<csrf_token>` template tag.
ru: Так как мы создаем POST форму (которая может привести к изменениям данных), нам следует побеспокоится о Cross Site Request Forgeries. Благодаря Django это очень просто. В общем, все POST формы, которые отправляются на внутренний URL, должны использовать тег :ttag:`{% csrf_token %}<csrf_token>`.

source: Now, let's create a Django view that handles the submitted data and does something with it. Remember, in :doc:`Tutorial 3 </intro/tutorial03>`, we created a URLconf for the polls application that includes this line::
ru: Теперь создадим представление Django, которые принимает данные отправленные формой и обрабатывает их. Вспомним, в :doc:`Части 3 </intro/tutorial03>` мы создали URLconf который содержит следующую строку::

source: We also created a dummy implementation of the ``vote()`` function. Let's create a real version. Add the following to ``polls/views.py``::
ru: Мы так же создали функцию-"заглушку" ``vote()``. Давайте создадим настоящую функцию представления. Добавьте следующее в ``polls/views.py``::

source: This code includes a few things we haven't covered yet in this tutorial:
ru: Этот код содержит вещи, которые еще не объяснялись в учебнике:

source: :attr:`request.POST <django.http.HttpRequest.POST>` is a dictionary-like object that lets you access submitted data by key name. In this case, ``request.POST['choice']`` returns the ID of the selected choice, as a string. :attr:`request.POST <django.http.HttpRequest.POST>` values are always strings.
ru: :attr:`request.POST <django.http.HttpRequest.POST>` -- это объект с интерфейсом словаря, который позволяет получить отправленные данные через название ключа. В нашем случае ``request.POST['choice']`` вернет ID выбранного варианта ответа в виде строки. :attr:`request.POST <django.http.HttpRequest.POST>` всегда содержит строки.

source: Note that Django also provides :attr:`request.GET <django.http.HttpRequest.GET>` for accessing GET data in the same way -- but we're explicitly using :attr:`request.POST <django.http.HttpRequest.POST>` in our code, to ensure that data is only altered via a POST call.
ru: Заметим что Django так же предоставляет :attr:`request.GET <django.http.HttpRequest.GET>` для аналогичного доступа к GET данным -- но мы используем :attr:`request.POST <django.http.HttpRequest.POST>` что бы быть уверенным, что данные передаются только при POST запросе.

source: After incrementing the choice count, the code returns an :class:`~django.http.HttpResponseRedirect` rather than a normal :class:`~django.http.HttpResponse`. :class:`~django.http.HttpResponseRedirect` takes a single argument: the URL to which the user will be redirected (see the following point for how we construct the URL in this case).
ru: После увеличения счетчика ответов, представление возвращает :class:`~django.http.HttpResponseRedirect` вместо :class:`~django.http.HttpResponse`. :class:`~django.http.HttpResponseRedirect` принимает один аргумент: URL, на который необходимо перенаправить пользователя (обратите внимание как мы создаем URL).

source: As the Python comment above points out, you should always return an :class:`~django.http.HttpResponseRedirect` after successfully dealing with POST data. This tip isn't specific to Django; it's just good Web development practice.
ru: После успешной обработки POST запроса, вы должны возвращать :class:`~django.http.HttpResponseRedirect`. Это не относится конкретно к Django, это просто хорошая практика при разработке Web-приложений.

source: We are using the :func:`~django.core.urlresolvers.reverse` function in the :class:`~django.http.HttpResponseRedirect` constructor in this example. This function helps avoid having to hardcode a URL in the view function. It is given the name of the view that we want to pass control to and the variable portion of the URL pattern that points to that view. In this case, using the URLconf we set up in Tutorial 3, this :func:`~django.core.urlresolvers.reverse` call will return a string like ::
ru: Мы используем функцию :func:`~django.core.urlresolvers.reverse` при создании :class:`~django.http.HttpResponseRedirect`. Это функция помогает избегать "хардкодинга" URL-ов в коде. Она принимает название URL-шаблона и необходимые аргументы для создания URL-а. В этом примере используется конфигурация URL-ов из Части 3 и :func:`~django.core.urlresolvers.reverse` вернет::

source: As mentioned in Tutorial 3, ``request`` is a :class:`~django.http.HttpRequest` object. For more on :class:`~django.http.HttpRequest` objects, see the :doc:`request and response documentation </ref/request-response>`.
ru: Как упоминалось в Части 3, ``request`` является экземпляром :class:`~django.http.HttpRequest`. Подробности о классе :class:`~django.http.HttpRequest` смотрите в разделе о :doc:`объектах запроса и ответа </ref/request-response>`.

source: After somebody votes in a poll, the ``vote()`` view redirects to the results page for the poll. Let's write that view::
ru: После ответа на опрос, представление ``vote()`` перенаправит пользователя на страницу с результатами. Давайте создадим представление для этой страницы::

source: This is almost exactly the same as the ``detail()`` view from :doc:`Tutorial 3 </intro/tutorial03>`. The only difference is the template name. We'll fix this redundancy later.
ru: Это представление аналогично представлению ``detail()`` из :doc:`Части 3 </intro/tutorial03>`. Единственная разница - используемый шаблон. Повторение кода мы исправим позже.

source: Now, go to ``/polls/1/`` in your browser and vote in the poll. You should see a results page that gets updated each time you vote. If you submit the form without having chosen a choice, you should see the error message.
ru: Теперь откройте страницу ``/polls/1/`` в браузере и ответьте на опрос. Вы должны увидеть страницу с результатами, которые обновляются после каждого ответа на опрос. Если вы отправите форму не ответив на вопрос, вы должны увидеть сообщение про ошибку.

source: Use generic views: Less code is better
ru: Общие представления: меньше кода - меньше проблем

source: The ``detail()`` (from :doc:`Tutorial 3 </intro/tutorial03>`) and ``results()`` views are stupidly simple -- and, as mentioned above, redundant. The ``index()`` view (also from Tutorial 3), which displays a list of polls, is similar.
ru: Представления ``detail()`` (из :doc:`Части 3 </intro/tutorial03>`) и ``results()`` до глупости просты -- и, как упоминалось выше, избыточны. Представление ``index()`` (также из Части 3), так же довольно стандартное.

source: These views represent a common case of basic Web development: getting data from the database according to a parameter passed in the URL, loading a template and returning the rendered template. Because this is so common, Django provides a shortcut, called the "generic views" system.
ru: Эти представления выполняют стандартные операции Веб-приложений: получение данных из базы данных в соответствии с параметрами из URL, загрузка шаблона и возвращение результата выполнения шаблона. Так как это обычные операции Django представляет систему "общих представлений(generic views)".

source: Generic views abstract common patterns to the point where you don't even need to write Python code to write an app.
ru: Общие представления позволяют создавать приложения практически не написав ни строчки кода Python.

source: Let's convert our poll app to use the generic views system, so we can delete a bunch of our own code. We'll just have to take a few steps to make the conversion. We will:
ru: Давайте используем их в нашем приложении. Необходимо выполнить следующие действия:

source: Convert the URLconf.
ru: Изменить URLconf.

source: Delete some of the old, unneeded views.
ru: Удалить старые и ненужные представления.

source: Fix up URL handling for the new views.
ru: Изменить URL-ы для новых представлений.

source: Read on for details.
ru: Подробности читайте далее.

source: Generally, when writing a Django app, you'll evaluate whether generic views are a good fit for your problem, and you'll use them from the beginning, rather than refactoring your code halfway through. But this tutorial intentionally has focused on writing the views "the hard way" until now, to focus on core concepts.
ru: Скорее всего вы будете использовать общие представления с самого начала без необходимости рефакторить проект. Этот учебник специально описывает создание представлений что бы описать основные концепции.

source: You should know basic math before you start using a calculator.
ru: Вы должны знать основы математики для использования калькулятора.

source: We're using two generic views here: :class:`~django.views.generic.list.ListView` and :class:`~django.views.generic.detail.DetailView`. Respectively, those two views abstract the concepts of "display a list of objects" and "display a detail page for a particular type of object."
ru: Мы используем здесь два общих представления: :class:`~django.views.generic.list.ListView` и :class:`~django.views.generic.detail.DetailView`. Эти два типа представлений отображают две концепции: "отображение списка объектов" и "отображение подробностей о конкретном объекте".

source: Each generic view needs to know what model it will be acting upon. This is provided using the ``model`` parameter.
ru: Каждое общее представление должно знать с какой моделью работать. Ее можно указать с помощью параметра ``model``.

source: Similarly, the :class:`~django.views.generic.list.ListView` generic view uses a default template called ``<app name>/<model name>_list.html``; we use ``template_name`` to tell :class:`~django.views.generic.list.ListView` to use our existing ``"polls/index.html"`` template.
ru: Аналогично :class:`~django.views.generic.list.ListView` использует шаблон ``<app name>/<model name>_list.html``, мы использовали ``template_name`` что бы определить другой шаблон - ``"polls/index.html"``.

source: Run the server, and use your new polling app based on generic views.
ru: Запустите сервер и протестируйте наше приложение.
