Repository: 43FUN/django_documentation
Catalog: locale/*/LC_MESSAGES/howto/deployment/wsgi/gunicorn.po
Languages: ru

source: How to use Django with Gunicorn
ru: Как использовать Django с Gunicorn

source: Gunicorn_ ('Green Unicorn') is a pure-Python WSGI server for UNIX. It has no dependencies and is easy to install and use.
ru: `Gunicorn <http://gunicorn.org/>`_ ('Green Unicorn') - WSGI сервер для UNIX написанный на Python. У него нет сторонних зависимостей, легко установить и использовать.

source: Installing Gunicorn
ru: Установка Gunicorn

source: Installing gunicorn is as easy as ``sudo pip install gunicorn``. For more details, see the `gunicorn documentation`_.
ru: Установить gunicorn можно с помощью команды ``sudo pip install gunicorn``. Подробности смотрите в `документациии gunicorn <http://docs.gunicorn.org/en/latest/install.html>`_.

source: Running Django in Gunicorn as a generic WSGI application
ru: Запуск Django с Gunicorn как WSGI приложения

source: When Gunicorn is installed, a ``gunicorn`` command is available which starts the Gunicorn server process. At its simplest, gunicorn just needs to be called with the location of a WSGI application object.::
ru: После установки Gunicorn становится доступна команда ``gunicorn``, которая запускает сервер Gunicorn. Самый простой вариант запуска - указать gunicorn путь к объекту WSGI приложения::

source: Where ``APP_MODULE`` is of the pattern ``MODULE_NAME:VARIABLE_NAME``. The module name should be a full dotted path. The variable name refers to a WSGI callable that should be found in the specified module.
ru: ``APP_MODULE`` должен быть в формате ``MODULE_NAME:VARIABLE_NAME``. Название модуля должно быть в формате импорта модуля Python. Название переменной - название вызываемого объекта WSGI приложения, который находится в указанном модуле.

source: So for a typical Django project, invoking gunicorn would look like::
ru: Для стандартного проекта Django запуск через gunicorn будет выглядеть следующим образом::

source: (This requires that your project be on the Python path; the simplest way to ensure that is to run this command from the same directory as your ``manage.py`` file.)
ru: (Ваш проект должен находиться в путях Python. Самый простой способ это сделать - вызвать команду в корне проекта, где находиться файл ``manage.py``.)

source: See Gunicorn's `deployment documentation`_ for additional tips.
ru: Дополнительные настройки смотрите в `документации Gunicorn <http://docs.gunicorn.org/en/latest/deploy.html>`_.
