Repository: 43FUN/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/auth/passwords.po
Languages: ru

source: Password management in Django
ru: Управление паролями в Django

source: Password management is something that should generally not be reinvented unnecessarily, and Django endeavors to provide a secure and flexible set of tools for managing user passwords. This document describes how Django stores passwords, how the storage hashing can be configured, and some utilities to work with hashed passwords.
ru: Управление паролями является такой сущностью, которую не следует переизобретать без особой необходимости и Django старается предоставить безопасный и гибкий набор инструментов для управления пользовательскими паролями. Этот документ описывает как Django хранит пароли, как может быть настроено их хэширование, а также некоторые утилиты для работы с хэшированными паролями.

source: How Django stores passwords
ru: Как Django хранит пароли

source: Django provides a flexible password storage system and uses PBKDF2 by default.
ru: Django предоставляет гибкую систему хранения паролей и по умолчанию использует PBKDF2.

source: The :attr:`~django.contrib.auth.models.User.password` attribute of a :class:`~django.contrib.auth.models.User` object is a string in this format::
ru: Атрибут :attr:`~django.contrib.auth.models.User.password` объекта :class:`~django.contrib.auth.models.User` является строкой следующего формата::

source: Those are the components used for storing a User's password, separated by the dollar-sign character and consist of: the hashing algorithm, the number of algorithm iterations (work factor), the random salt, and the resulting password hash. The algorithm is one of a number of one-way hashing or password storage algorithms Django can use; see below. Iterations describe the number of times the algorithm is run over the hash. Salt is the random seed used and the hash is the result of the one-way function.
ru: Данная строка показывает компоненты, которые используются для хранения пользовательского пароля и разделены знаком доллара, а именно: хэширующий алгоритм, количество итераций алгоритма (work factor), случайная соль и полученный хэш пароля. Алгоритмом может быть любой из ряда однонаправленных хэширующих алгоритмов, которые использует Django; см. далее. Итерации описывают количество применений алгоритма для получения хэша. Соль является случайными данным, а сам хэш получается в результате работы однонаправленной функции.

source: By default, Django uses the PBKDF2_ algorithm with a SHA256 hash, a password stretching mechanism recommended by NIST_. This should be sufficient for most users: it's quite secure, requiring massive amounts of computing time to break.
ru: По умолчанию, Django использует алгоритм PBKDF2_ с хэшем SHA256, механизм защиты паролей рекомендованный NIST_. Этого должно хватить для большинства пользователей: достаточная защита, требующая большой объём вычислительного времени для взлома.

source: However, depending on your requirements, you may choose a different algorithm, or even use a custom algorithm to match your specific security situation. Again, most users shouldn't need to do this -- if you're not sure, you probably don't. If you do, please read on:
ru: Тем не менее, в зависимости от ваших требований, вы можете выбрать другой алгоритм или даже реализовать собственный алгоритм, который будет соответствовать вашим требованиям к безопасности. Итак, большинство пользователей не должны думать об этом, если вы сомневаетесь, значит вам это точно не надою В противном случае, прочитайте:

source: Django chooses the algorithm to use by consulting the :setting:`PASSWORD_HASHERS` setting. This is a list of hashing algorithm classes that this Django installation supports. The first entry in this list (that is, ``settings.PASSWORD_HASHERS[0]``) will be used to store passwords, and all the other entries are valid hashers that can be used to check existing passwords. This means that if you want to use a different algorithm, you'll need to modify :setting:`PASSWORD_HASHERS` to list your preferred algorithm first in the list.
ru: Django выбирает алгоритм для использования в соответствии с указанием переменной конфигурации :setting:`PASSWORD_HASHERS`. Переменная содержит список классов реализующих алгоритмы хэширования, которые поддерживает Django. Первая запись этого списка (речь о ``settings.PASSWORD_HASHERS[0]``) будет использоваться для сохранения паролей, а все остальные записи являются проверенными средствами, которые могут быть применены для проверки существующих паролей. Это означает, что вам потребуется использовать другой алгоритм хэширования, вам потребуется просто указать его первым в параметре конфигурации :setting:`PASSWORD_HASHERS`.

source: The default for :setting:`PASSWORD_HASHERS` is::
ru: По умолчанию :setting:`PASSWORD_HASHERS` содержит::

source: This means that Django will use PBKDF2_ to store all passwords, but will support checking passwords stored with PBKDF2SHA1, bcrypt_, SHA1_, etc. The next few sections describe a couple of common ways advanced users may want to modify this setting.
ru: Это означает, что Django будет использовать PBKDF2_ для сохранения всех паролей, но будет поддерживать проверку паролей, сохранённых с помощью PBKDF2SHA1, bcrypt_, SHA1_ и так далее. Следующие несколько разделов описывают ряд общих способов, которые могут быть использованы опытными пользователями для изменения данного параметра конфигурации.

source: Using bcrypt with Django
ru: Использование bcrypt с Django

source: Bcrypt_ is a popular password storage algorithm that's specifically designed for long-term password storage. It's not the default used by Django since it requires the use of third-party libraries, but since many people may want to use it Django supports bcrypt with minimal effort.
ru: Bcrypt_ является популярным алгоритмом для хранения паролей, который специально разработан для хранения "долгих" паролей. Данный алгоритм не выбран в качестве стандартного в Django так как он требует использования внешних библиотек, но раз он используется многими, то Django поддерживает его, требуя минимальных усилий по его установке.

source: To use Bcrypt as your default storage algorithm, do the following:
ru: Для использования Bcrypt в качестве алгоритма по умолчанию, выполните следующие действия:

source: Install the `bcrypt library`_. This can be done by running ``pip install django[bcrypt]``, or by downloading the library and installing it with ``python setup.py install``.
ru: Установите `bcrypt library`_. Это можно сделать с помощью команды ``pip install django[bcrypt]`` или скачайте библиотеку и установите её с помощью команды ``python setup.py install``.

source: Modify :setting:`PASSWORD_HASHERS` to list ``BCryptSHA256PasswordHasher`` first. That is, in your settings file, you'd put::
ru: Измените :setting:`PASSWORD_HASHERS` так, чтобы ``BCryptSHA256PasswordHasher`` был указан первым. То есть, в файле конфигурации надо сделать так::

source: (You need to keep the other entries in this list, or else Django won't be able to upgrade passwords; see below).
ru: (Следует сохранить остальные записи в списке, иначе Django не сможет обновлять пароли; см. далее)

source: That's it -- now your Django install will use Bcrypt as the default storage algorithm.
ru: Вот так, теперь Django по умолчанию будет использовать Bcrypt в качестве алгоритма хранения паролей.

source: Password truncation with BCryptPasswordHasher
ru: Обрезание паролей с помощью BCryptPasswordHasher

source: The designers of bcrypt truncate all passwords at 72 characters which means that ``bcrypt(password_with_100_chars) == bcrypt(password_with_100_chars[:72])``. The original ``BCryptPasswordHasher`` does not have any special handling and thus is also subject to this hidden password length limit. ``BCryptSHA256PasswordHasher`` fixes this by first first hashing the password using sha256. This prevents the password truncation and so should be preferred over the ``BCryptPasswordHasher``. The practical ramification of this truncation is pretty marginal as the average user does not have a password greater than 72 characters in length and even being truncated at 72 the compute powered required to brute force bcrypt in any useful amount of time is still astronomical. Nonetheless, we recommend you use ``BCryptSHA256PasswordHasher`` anyway on the principle of "better safe than sorry".
ru: Разработчики алгоритма bcrypt обрезают все пароли до 72 символов, что означает ``bcrypt(password_with_100_chars) == bcrypt(password_with_100_chars[:72])``. Оригинальный ``BCryptPasswordHasher`` не использует особую обработку и, следовательно, также имеет аналогичное ограничение на длину пароля. ``BCryptSHA256PasswordHasher`` исправляет это поведение, сначала хэшируя пароль с помощью sha256. Это действие предотвращает обрезание пароля, рекоментуем использовать эту реализацию вместо ``BCryptPasswordHasher``. Причина применения такого обрезания проста, длина пароля обычного пользователя не превышает 72 символа и, даже будучи обрезанным до 72 символов, такой пароль всё равно требует значительных вычислительных ресурсов для его прямого подбора. Тем не менее, мы рекомендуем использовать ``BCryptSHA256PasswordHasher`` в любом случае по принципу "запас карман не тянет".

source: Other bcrypt implementations
ru: Другие реализации bcrypt

source: There are several other implementations that allow bcrypt to be used with Django. Django's bcrypt support is NOT directly compatible with these. To upgrade, you will need to modify the hashes in your database to be in the form ``bcrypt$(raw bcrypt output)``. For example: ``bcrypt$$2a$12$NT0I31Sa7ihGEWpka9ASYrEFkhuTNeBQ2xfZskIiiJeyFXhRgS.Sy``.
ru: Существует несколько других реализаций алгоритма, которые позволяют использовать bcrypt в Django. Django *не поддерживает* из из коробки. Для активации поддержки, вам потребуется привести хэши в вашей базе данных к виду ``bcrypt$(raw bcrypt output)``. Например: ``bcrypt$$2a$12$NT0I31Sa7ihGEWpka9ASYrEFkhuTNeBQ2xfZskIiiJeyFXhRgS.Sy``.

source: Increasing the work factor
ru: Увеличение сложности хэша

source: The PBKDF2 and bcrypt algorithms use a number of iterations or rounds of hashing. This deliberately slows down attackers, making attacks against hashed passwords harder. However, as computing power increases, the number of iterations needs to be increased. We've chosen a reasonable default (and will increase it with each release of Django), but you may wish to tune it up or down, depending on your security needs and available processing power. To do so, you'll subclass the appropriate algorithm and override the ``iterations`` parameters. For example, to increase the number of iterations used by the default PBKDF2 algorithm:
ru: Алгоритмы PBKDF2 и bcrypt используют ряд итераций или округлений для хэшей. Это значительно замедляют действия атакующих, усложняя выполнение атаки на хэшированные пароли. Однако, по мере увеличения вычислительной мощности, количество этих итераций следует увеличивать. Мы установили достаточное значение по умолчанию (и будем его увеличивать с каждым новым релизом Django), но вы можете пожелать увиличить или уменьшить это значение самостоятельно, в зависимости от вашей политики безопасности и вычислительной мощности, имеющейся в наличии. Чтобы сделать это, следует унаследоваться от класса нужного алгоритма и переопределить параметры ``iterations``. Например, для увеличения количества итераций в алгоритме PBKDF2:

source: Create a subclass of ``django.contrib.auth.hashers.PBKDF2PasswordHasher``::
ru: Унаследуйтесь от ``django.contrib.auth.hashers.PBKDF2PasswordHasher``::

source: Save this somewhere in your project. For example, you might put this in a file like ``myproject/hashers.py``.
ru: Сохраните это в ваш проект. Например, вы можете разместить это в файле подобном ``myproject/hashers.py``.

source: Add your new hasher as the first entry in :setting:`PASSWORD_HASHERS`::
ru: Добавьте новый алгоритм хэширования в начало списка конфигурационного параметра :setting:`PASSWORD_HASHERS`::

source: That's it -- now your Django install will use more iterations when it stores passwords using PBKDF2.
ru: Вот так, теперь Django будет использовать большее количество итераций при сохранении паролей с помощью PBKDF2.

source: Password upgrading
ru: Обновление паролей

source: When users log in, if their passwords are stored with anything other than the preferred algorithm, Django will automatically upgrade the algorithm to the preferred one. This means that old installs of Django will get automatically more secure as users log in, and it also means that you can switch to new (and better) storage algorithms as they get invented.
ru: При аутентификации пользователей, если их пароли сохранены с помощью алгоритма, отличающегося от стандартного, то Django будет автоматически применять стандартный алгоритм хэширования. Это означает, что старые установки Django автоматически получат обновление в области аутентификации пользователей, и это также означает, что вы можете переключаться на новые (и более лучшие) алгоритмы хранения паролей по мере их изобретения.

source: However, Django can only upgrade passwords that use algorithms mentioned in :setting:`PASSWORD_HASHERS`, so as you upgrade to new systems you should make sure never to *remove* entries from this list. If you do, users using unmentioned algorithms won't be able to upgrade. Passwords will be upgraded when changing the PBKDF2 iteration count.
ru: Тем не менее, Django может обновлять хэш только тех паролей, которые были захэшированы с помощью алгоритмов, перечисленных в параметре конфигурации :setting:`PASSWORD_HASHERS`. Таким образом, при переходе на новый алгоритм хэширования следует удостовериться, что старые алгоритмы не были *удалены" из списка алгоритмов. В противном случае, пароли пользователей захэшированные неупомянутым в параметре конфигурации алгоритмом не будут обновлены. Пароли также обновляются при изменении количества итераций у алгоритма PBKDF2.

source: Manually managing a user's password
ru: Ручное управление паролями пользователей

source: The :mod:`django.contrib.auth.hashers` module provides a set of functions to create and validate hashed password. You can use them independently from the ``User`` model.
ru: Модуль :mod:`django.contrib.auth.hashers` предоставляет набор функций для создания и проверки хэшированных паролей. Вы можете использовать эти функции независимо от модели ``User``l.

source: If you'd like to manually authenticate a user by comparing a plain-text password to the hashed password in the database, use the convenience function :func:`check_password`. It takes two arguments: the plain-text password to check, and the full value of a user's ``password`` field in the database to check against, and returns ``True`` if they match, ``False`` otherwise.
ru: Если требуется вручную аутентифицировать пользователя с помощью сравнения открытого пароля с захэшированным паролем из базы данных, используйте вспомогательную функцию :func:`check_password`. Она принимает два аргумента: открытый пароль и полное значение поля ``password`` из базы данных, возвращает ``True`` при совпадении и ``False`` в противном случае.

source: Creates a hashed password in the format used by this application. It takes one mandatory argument: the password in plain-text. Optionally, you can provide a salt and a hashing algorithm to use, if you don't want to use the defaults (first entry of ``PASSWORD_HASHERS`` setting). Currently supported algorithms are: ``'pbkdf2_sha256'``, ``'pbkdf2_sha1'``, ``'bcrypt_sha256'`` (see :ref:`bcrypt_usage`), ``'bcrypt'``, ``'sha1'``, ``'md5'``, ``'unsalted_md5'`` (only for backward compatibility) and ``'crypt'`` if you have the ``crypt`` library installed. If the password argument is ``None``, an unusable password is returned (a one that will be never accepted by :func:`check_password`).
ru: Создаёт хэшированный пароль в формате, используемом этим приложением. Принимает один обязательный аргумент: открытый пароль. Опционально, если вам не надо использовать стандартные настройки (первая запись списка ``PASSWORD_HASHERS``), вы можете указать "соль" и алгоритм, который следует использовать для хэширования, Сейчас поддерживаются следующие алгоритмы: ``'pbkdf2_sha256'``, ``'pbkdf2_sha1'``, ``'bcrypt_sha256'`` (см. :ref:`bcrypt_usage`), ``'bcrypt'``, ``'sha1'``, ``'md5'``, ``'unsalted_md5'`` (в целях обратной совместимости) и ``'crypt'``, если соответствующая библиотека установлена в системе. Если аргумент с паролем содержит ``None``, возвращается бесполезный пароль, который никогда не будет пропущен функцией :func:`check_password`.

source: Checks if the given string is a hashed password that has a chance of being verified against :func:`check_password`.
ru: Проверяет, является ли переданная строка хэшированным паролем, который имеет шанс пройти проверку с помощью функции :func:`check_password`.
